{"speakers": [], "chunks": [{"timestamp": [0.0, 7.0], "text": " The following is a work of fiction. Any resemblance to actual persons, living or dead, is coincidental and unintentional."}, {"timestamp": [16.0, 20.0], "text": " Hello friends, good evening. Let's start today's episode of Counter-commentary."}, {"timestamp": [20.0, 26.0], "text": " Today my guest and associate in the studio is the journalist Hristo Hristov, researcher of the archives of State Security."}, {"timestamp": [26.0, 31.0], "text": " Also in his practice there is a period when he was a court reporter. Hello, good evening."}, {"timestamp": [31.0, 34.0], "text": " Hello, colleague Genov. Good evening."}, {"timestamp": [34.0, 37.0], "text": " Thank you for being invited for this conversation."}, {"timestamp": [37.0, 48.0], "text": " I continue with the words and precisely as a person who combines two in one, court reporter of the time and today the most sophisticated researcher of the archives of state security,"}, {"timestamp": [48.0, 66.0], "text": " I am not bothered to discuss the topic related to the rejuvenation process in Bulgarian politics. In short, what I want to say as a first words, the so-called revolutionary process is an attempt"}, {"timestamp": [66.0, 72.0], "text": " of the Bulgarian Communist Party to impose violent assimilation of the Muslim population in the country."}, {"timestamp": [72.0, 79.0], "text": " This includes Turks, Palmatians, Tatars, Roma and so on. The topic is already actively used in the election campaign,"}, {"timestamp": [79.0, 89.0], "text": " I have already said that, so my interlocutor is Christo Hristov. The name that is known in the society process of systemic repressions against the mentioned social groups and ethnic groups is grotesque."}, {"timestamp": [89.0, 91.0], "text": " Absolutely inappropriate."}, {"timestamp": [91.0, 94.0], "text": " Nothing in common and nothing offensive is in this process."}, {"timestamp": [94.0, 100.0], "text": " It started somewhere in the 70s and continued until the end of the 80s of the 20th century."}, {"timestamp": [100.0, 106.8], "text": " This is one of the most shameful political pages for our people and our history."}, {"timestamp": [106.8, 114.5], "text": " Our people, we Bulgarians, are famous and we are sometimes ashamed to underline how tolerant we are."}, {"timestamp": [114.5, 119.6], "text": " Besides, this page or this so-called revolutionary process is unsuccessful."}, {"timestamp": [119.6, 126.24], "text": " It is initially doomed to failure and gives exactly the opposite results of the expected, probably from the communists at that time."}, {"timestamp": [126.24, 131.08], "text": " Instead of being united and integrated into society, the Bulgarian Muslims capsulate."}, {"timestamp": [131.08, 133.76], "text": " To a great extent, they remain the same even today."}, {"timestamp": [133.76, 146.0], "text": " And here, on the political scene, Darian Peevski appears and everything that follows from his appearance and the way he uses the topic of the revolutionary process. And this is the reason for today's episode."}, {"timestamp": [146.0, 150.0], "text": " Good evening again, Christo Christo in the Contrakomentar studio."}, {"timestamp": [150.0, 151.0], "text": " Hello again."}, {"timestamp": [151.0, 154.0], "text": " Let's start with a little retrospective."}, {"timestamp": [154.0, 158.0], "text": " After 1944, the politics of the Bulgarian Communist Party towards the Bulgarian Muslims"}, {"timestamp": [158.0, 174.6], "text": " varied from brutal repressions, violence, assimilation, toleration in a certain sense, namely, certain privileges are provided, Turkish-language intelligence is created,"}, {"timestamp": [174.6, 185.5], "text": " administrative staff, in addition to that special quotas in schools and the party-state apparatus. Newsstands in Turkey are published or at least such experiments are made."}, {"timestamp": [185.5, 194.0], "text": " A large part of the state budget for development and industrialization of the so-called mixed regions is allocated,"}, {"timestamp": [194.0, 199.5], "text": " high children's benefits and other social privileges of the multi-child Muslim families."}, {"timestamp": [199.5, 209.0], "text": " However, my first question to you is the so-called development process. How executive process get to you? Is there any specific reason?"}, {"timestamp": [210.0, 223.0], "text": " First of all I want to congratulate you that you are one of the few independent journalists who don't jump and don't look with a light hand at topics"}, {"timestamp": [227.0, 234.0], "text": " and they don't look at topics that most media think are in the past. You see, 35 years after the collapse of the communist system, we are in the mud of the past,"}, {"timestamp": [234.0, 251.0], "text": " unspoken, with unsolved problems, with hanging decades of deeds, so I admire them. You did a very good job of a retrospective of the communist regime."}, {"timestamp": [251.0, 268.54], "text": " These attempts to assimilate began with the passportization in the 1950s, then there were attempts in the first half of the 1960s"}, {"timestamp": [268.54, 291.48], "text": " in connection with repressions against the General Secretary of the Communist Party, Todor Zhivkov,"}, {"timestamp": [291.48, 296.92], "text": " for the change of the name of the Bulgarian Parliament."}, {"timestamp": [296.92, 334.0], "text": " After the changes, the declaration was adopted, which clearly shows that this is an assimilation. This is especially in this third phase, which I read with the permission of the Supreme Court,"}, {"timestamp": [334.0, 345.0], "text": " he said that he felt the fear of increasing this ethnic mass. He is so much"}, {"timestamp": [345.0, 348.0], "text": " suggested by the feeling of power,"}, {"timestamp": [348.0, 351.0], "text": " as it happens with most dictators,"}, {"timestamp": [351.0, 357.0], "text": " that he thought that if he didn't do this action,"}, {"timestamp": [357.0, 360.0], "text": " no one else would do it after him."}, {"timestamp": [360.0, 363.0], "text": " His main goal is"}, {"timestamp": [363.0, 393.2], "text": " not only to change the names, but also to force Turkey to open the borders and to have a mandatory displacement of a life in the hearing, whether there will be or not,"}, {"timestamp": [393.2, 412.52], "text": " in a permanent anxiety, so that it reaches the autumn of 1984, when the name-calling campaign began in the Kyrgyzstan district."}, {"timestamp": [413.08, 432.0], "text": " Todor Zhivkov thought that this way he period when the People's Republic of Bulgaria and the totalitarian communist regime"}, {"timestamp": [432.0, 455.0], "text": " took a brave step towards the third fall. The fall was in 1987. This is the forced expulsion of about 360,000 Bulgarian citizens from Turkey in the summer of 1989."}, {"timestamp": [455.0, 461.0], "text": " This leads to an even more convincing economic catastrophe of this regime,"}, {"timestamp": [461.0, 466.0], "text": " because these people work in the agriculture sector, they are left without a job,"}, {"timestamp": [466.0, 472.0], "text": " they have a huge lack of work and so on."}, {"timestamp": [472.0, 477.0], "text": " So you have correctly determined that this is a failed experiment."}, {"timestamp": [477.0, 514.0], "text": " Let us remind that one of the first decisions of the Politburo after the forced resignation of Todor Zhivkov, is to reject this action, because he put a barrier in the this, there is one unanswered question. The process of revolution itself is in practice the withdrawal of the state,"}, {"timestamp": [514.0, 520.0], "text": " the forced withdrawal of the main personal rights such as the right to self-determination, the freedom of expression and so on."}, {"timestamp": [520.0, 526.5], "text": " The concept of the revolutionary process itself, as you have outlined, is imposed by the party's top in the Bulgarian Communist Party."}, {"timestamp": [526.5, 535.5], "text": " It is rooted in the official doctrine that all Bulgarian Turks were violently Islamized during the Ottoman Empire and, I quote,"}, {"timestamp": [535.5, 556.0], "text": " in their veins flows Bulgarian blood. These are two very dubious statements from a historical point of view, but the main question, whose answer we will try to find and give in this episode of Contra Commentar, is how these crimes remain without consequences and the guilty is not found even today."}, {"timestamp": [592.0, 593.0], "text": " Let's remind that the case of the so-called reviving trial is actually the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the corpses, but they missed the case that is the longest standing on the corpse. Number two."}, {"timestamp": [593.0, 594.0], "text": " Exactly this case."}, {"timestamp": [594.0, 607.0], "text": " And the colleagues, I understand that there is a change of generation in Bulgarian journalism, the young colleagues have no idea about these attempts to punish the communist crimes."}, {"timestamp": [607.0, 614.0], "text": " But yes, this case was formed by the Military Prosecutor's Office in 1991."}, {"timestamp": [614.0, 629.0], "text": " It was accused of Todor Zhivkov, former General Secretary of the Communist Party the Chairman of the State Council until 1989."}, {"timestamp": [629.0, 647.32], "text": " The Minister of Foreign Affairs Peter Mladenov, the Minister of Internal Affairs General Dimitar Stoyanov, former Communist Prime Minister Georgiy Atanasov and a member of the Politburo, Pencho Kobadinsky,"}, {"timestamp": [647.32, 658.6], "text": " who is in a staff on the strategy for implementation, but he is excluded, by the way, from this staff,"}, {"timestamp": [658.6, 669.62], "text": " from this group, because he allows himself to say that we can't heal 800 thousand souls and say that they are gone."}, {"timestamp": [669.62, 695.0], "text": " In his testimony, in part 1, I can literally quote it, because it's part of my biography of Todor Zhivkov isolated him and one day he called me, the first secretary of the Communist Party in Shumen,"}, {"timestamp": [695.0, 705.0], "text": " and he told me that Drogario Kobadinsky was the one who the Constitution and they ordered us to do it."}, {"timestamp": [705.0, 709.0], "text": " Pencho Kubadin told me this and I immediately called the other Odrojevko."}, {"timestamp": [709.0, 730.0], "text": " I asked him what had happened and he told me that he had finished his work. The most perfidious escape from responsibility was that the new constitution was made by the communists."}, {"timestamp": [730.0, 747.0], "text": " And by the lawyers, even Todor Zhivkov took advantage of the new constitution to protect himself from corruption and abuse of power, using the new constitution, because they said that he was a state leader,"}, {"timestamp": [747.0, 753.0], "text": " according to the new constitution he is a state leader and he still doesn't have responsibility for criminal crimes."}, {"timestamp": [753.0, 760.0], "text": " That is, if the president makes a disaster, makes another criminal act, he doesn't have responsibility."}, {"timestamp": [760.0, 767.0], "text": " Which is quite controversial. But this is how it was adopted by the new constitution in 1991."}, {"timestamp": [767.0, 774.0], "text": " And Todor Zhivkov was elected, who is the chairman of the State Council."}, {"timestamp": [774.0, 780.0], "text": " The State Council has nothing to do with the presidency. It is a group body."}, {"timestamp": [780.0, 790.0], "text": " Except that we position is built by us. Yes, and he came during the management of the BSP to the party cabinet of Jean Vidi, but the Supreme Court"}, {"timestamp": [790.0, 828.76], "text": " accepted that Todor Zhivkov was with his state head, therefore he cannot be sentenced because he was sentenced to seven years The case of the reviving process started, of course, as all other cases, very actively, but with the change that the Military Prosecutor's Office had set"}, {"timestamp": [829.18, 835.72], "text": " was to seek responsibility from the highest communist authority"}, {"timestamp": [837.16, 847.0], "text": " for those brightest and toughest Bulgarian citizens of the Turkish origin,"}, {"timestamp": [847.0, 851.0], "text": " who did not accept to be changed their names and were isolated,"}, {"timestamp": [851.0, 855.0], "text": " opening the concentration camp Belen again on the island of Persin."}, {"timestamp": [855.0, 865.5], "text": " The first group arrived on December 28, 1984 from Krdjalisko. in 1984 by the first people of Kyrgyzstan."}, {"timestamp": [865.5, 878.08], "text": " The prosecutor's office for 33 years can't find any 517 Bulgarian citizens from the Turkish"}, {"timestamp": [878.08, 881.38], "text": " continent who were isolated. That's the framework."}, {"timestamp": [881.38, 884.18], "text": " You mean they can't find witnesses?"}, {"timestamp": [884.18, 886.0], "text": " Exactly."}, {"timestamp": [886.0, 888.0], "text": " They come every year, part of them are on bail."}, {"timestamp": [888.0, 890.0], "text": " They want to be in court."}, {"timestamp": [890.0, 892.0], "text": " By the way, the prosecutor's office,"}, {"timestamp": [892.0, 894.0], "text": " knowing that they are in court,"}, {"timestamp": [894.0, 896.0], "text": " in practice,"}, {"timestamp": [896.0, 898.0], "text": " they are judging the state's payment."}, {"timestamp": [898.0, 900.0], "text": " Maybe a dozen former campers"}, {"timestamp": [900.0, 902.0], "text": " or descendants of the deceased campers"}, {"timestamp": [902.0, 904.0], "text": " have already been judged by the prosecutor's office"}, {"timestamp": [904.0, 915.0], "text": " here in Bulgaria for violations of the rights of the court."}, {"timestamp": [915.0, 917.0], "text": " For fraudulent trial."}, {"timestamp": [917.0, 932.0], "text": " Yes, I had the opportunity to talk to some of them and they say that they want justice."}, {"timestamp": [932.0, 938.0], "text": " The prosecutor's office, I will say it directly, instead of..."}, {"timestamp": [938.0, 939.0], "text": " The military?"}, {"timestamp": [939.0, 947.0], "text": " Yes, this is the case at the moment, it is being handled by the Sofia Military District Prosecutor's Office."}, {"timestamp": [947.0, 974.68], "text": " You cannot be a state accused and for so many years you have been holding a case against the troops and So, unfortunately, we have to say directly, without exaggeration, that the prosecutor's office, instead of protecting the rights of the victims,"}, {"timestamp": [974.68, 977.8], "text": " became a participant in the investigation of these crimes."}, {"timestamp": [977.8, 996.0], "text": " I will say it directly, this is a fact, let them prove it to me. They didn't have the opportunity to make so many court orders, to get in with the former campers' organization,"}, {"timestamp": [996.0, 1005.2], "text": " which is very active in obtaining justice. These people don't want anything else."}, {"timestamp": [1005.2, 1014.66], "text": " But it has come to the point that we can already see how the political use of this case"}, {"timestamp": [1014.66, 1032.0], "text": " is taking forward again the fact that the prosecutor of the civil organization Justice, Law and Cultural Cooperation of the Balkans."}, {"timestamp": [1032.0, 1052.72], "text": " This is the name of the Court of Appeal,"}, {"timestamp": [1052.72, 1057.04], "text": " saying that there is no justice and the Prosecutor's Office has stopped the case."}, {"timestamp": [1057.04, 1069.12], "text": " It was stopped in March 2022, because then the last accused of the Communist Party the Communist Party died, former Premier Georgi Atanasov."}, {"timestamp": [1069.12, 1075.92], "text": " They complained about the resolution, the society complained about the resolution, so there are no politicians here."}, {"timestamp": [1075.92, 1089.3], "text": " There is no DPS, there the rights of the victims of the revocable process,"}, {"timestamp": [1089.3, 1098.0], "text": " the responsibility and the steps of the prosecutor's office had to be established long ago in order to finish this case."}, {"timestamp": [1098.0, 1110.0], "text": " Not through political pressure, but through questions to the court authorities about on this case? Are there other reasons why the chief prosecutors were replaced?"}, {"timestamp": [1110.0, 1125.0], "text": " In practice, it all started at the beginning of the transition, all chief prosecutors after the change were in their hands. Exactly. With different political varieties. Something more."}, {"timestamp": [1125.0, 1132.0], "text": " When the former Lagerists' Society in Belene"}, {"timestamp": [1132.0, 1138.0], "text": " two years ago complained about this Procuratorate's decision to stop,"}, {"timestamp": [1138.0, 1142.0], "text": " something happened that very few people expected."}, {"timestamp": [1142.0, 1148.2], "text": " The Sofia Appellate Court rejected the Procuratorate's decision Very few people expected the Sofia Court of Appeal to reject the prosecution's ruling."}, {"timestamp": [1148.2, 1172.0], "text": " Two years ago, and more in the summer, the, by the executors, because the top one is..."}, {"timestamp": [1172.0, 1211.32], "text": " She has dropped this task, but there are executors, the entire repressive apparatus of state security and the prosecutor's office was surprised. The court, which is an admiration for the Bulgarian court, for this composition of the Sofia Court of Appeal, says that the prosecutor's office is obliged to present the Sofia, from the Society, that is getting to know each other. Actually, after the signal of Delian Peevski, the Prosecutor's Office is acting in a different way"}, {"timestamp": [1211.32, 1217.44], "text": " and is stopping the publication of the investigative materials,"}, {"timestamp": [1217.44, 1223.84], "text": " so that he can start to execute what Peevski has written in his signal."}, {"timestamp": [1223.84, 1225.0], "text": " This is very interesting."}, {"timestamp": [1225.0, 1230.0], "text": " He claims that Peevski and a group of deputies from his wing,"}, {"timestamp": [1230.0, 1236.0], "text": " Jordan Tson and a few other deputies, they are sending the signal."}, {"timestamp": [1236.0, 1253.0], "text": " The question is why are are giving it now, as Dilyan Peevski, last year, at the beginning of the year of the revival process in Kyrgyzstan, said that there will be justice for the victims."}, {"timestamp": [1253.0, 1258.0], "text": " So this December, the month, prepares this request."}, {"timestamp": [1258.0, 1260.0], "text": " It's hard to write a signal."}, {"timestamp": [1260.0, 1262.0], "text": " Yes, it's hard to write this signal."}, {"timestamp": [1262.0, 1276.32], "text": " And by chance, we have now elections. The Prosecutor's Office in this decision literally accepts his thesis that without pointing out specific names,"}, {"timestamp": [1276.32, 1286.84], "text": " the Pevski signal points out that there are state security agents who are directly involved in the execution of the revocation process."}, {"timestamp": [1286.84, 1293.44], "text": " But before there are agents involved, someone is leading them."}, {"timestamp": [1293.44, 1307.76], "text": " And if the prosecutor's office is objective, it would have to start investigating the executors of this process two years ago, to start investigating the perpetrators of this process."}, {"timestamp": [1307.76, 1320.24], "text": " And here is a very interesting document, a secret decree 1313 of the State Council of 1986,"}, {"timestamp": [1320.24, 1333.0], "text": " signed by Todor Zhivkov, which which there are over 100 names of senior state security officers from various central and district administrations of the DSE,"}, {"timestamp": [1333.0, 1343.0], "text": " who are awarded for the reviving process. And the most elementary and easy thing that the prosecutor's office can do and had to do is to start checking..."}, {"timestamp": [1343.0, 1346.3], "text": " Most likely some of them are still alive."}, {"timestamp": [1346.3, 1351.2], "text": " Yes, yes. But look at what the prosecutor's office is doing now."}, {"timestamp": [1351.2, 1360.2], "text": " It starts now in the decree ordered by military investigators to the Sofia Military District Prosecutor's Office"}, {"timestamp": [1360.2, 1365.5], "text": " to start picking up agents who have worked in the reviving process."}, {"timestamp": [1365.5, 1371.0], "text": " There are officers there, and they are looking for agents. Why?"}, {"timestamp": [1371.0, 1379.0], "text": " I think that Pevski is aiming to attack Dugan."}, {"timestamp": [1379.0, 1385.68], "text": " I wrote on my website that I will't be surprised if the prosecutor's office,"}, {"timestamp": [1385.68, 1389.64], "text": " taking this direction so expeditiously,"}, {"timestamp": [1389.64, 1397.4], "text": " before the elections, we see Ahmed Dogan and other state security agents,"}, {"timestamp": [1397.4, 1401.24], "text": " such as Ramadan Atalay, who have been announced a long time ago,"}, {"timestamp": [1401.24, 1402.88], "text": " we know this fact,"}, {"timestamp": [1402.88, 1408.0], "text": " to be called for a pre-election prosecutor's show on this matter."}, {"timestamp": [1408.0, 1432.0], "text": " We will talk specifically about the role of 1984, the beginning of 1985."}, {"timestamp": [1432.0, 1450.0], "text": " From the spring of 1982 in the spring of 1984."}, {"timestamp": [1450.0, 1454.0], "text": " Initially, the campaign for the name of the country was supported by South Bulgaria,"}, {"timestamp": [1454.0, 1460.0], "text": " and the decision to name it as the Northern Bulgaria was taken in a meeting held on 18 January 1985."}, {"timestamp": [1460.0, 1466.6], "text": " The then Minister-President Georgi Gatanasov for the first time uses the name of the revolutionary process."}, {"timestamp": [1466.6, 1471.68], "text": " On February 11, the same year, Minister Dimitar Stoyanov counts the end of the active campaign,"}, {"timestamp": [1471.68, 1481.76], "text": " in which, perhaps next year, in 1985, 822,588 people were named."}, {"timestamp": [1481.76, 1492.0], "text": " According to a later report, the number of the people named in 1984-1985 is 1,306,000."}, {"timestamp": [1492.0, 1508.0], "text": " In March, Georgi Atanasov proudly announced that all citizens of the country already have names in accordance with their Bulgarian family root. I also gave three names and you mentioned them earlier. Todor Zhivkov, Georgi Atanasov, Dimitar Stoyanov."}, {"timestamp": [1508.0, 1516.0], "text": " They are de facto innocent to this day. How is that possible? They are dead, I think three of them are dead, but they are innocent."}, {"timestamp": [1516.0, 1519.0], "text": " Georgi Atanasov died in the last year of 2022."}, {"timestamp": [1519.0, 1526.56], "text": " What is your comment on their innocence? This is the result of the lack of action of the Prosecutor's Office on this case."}, {"timestamp": [1526.56, 1528.56], "text": " This is absurd."}, {"timestamp": [1528.56, 1534.36], "text": " We have to remember that this case was brought to court twice."}, {"timestamp": [1534.36, 1538.56], "text": " In 1993 it was returned to court with a statement."}, {"timestamp": [1538.56, 1554.0], "text": " It was aimed at thepelling the victims, because when a court trial is being conducted and you say that the rights of the innocent are violated in Belene, you have to prove it."}, {"timestamp": [1554.0, 1571.0], "text": " This is not a part of the communist regime. It is difficult to deal with so many victims, but the Prosecutor's Office has the resources and should be able to handle this task in 30 years."}, {"timestamp": [1571.0, 1586.4], "text": " We don't see this thing being done. The authorities, with the help of the Foundation, have been providing access to information for about a year,"}, {"timestamp": [1586.4, 1589.2], "text": " a report with the Chief Prosecutor,"}, {"timestamp": [1589.2, 1595.8], "text": " in which they want, according to the law, access to public information,"}, {"timestamp": [1595.8, 1603.6], "text": " statistical information from 1989, from the collapse of communism until now."}, {"timestamp": [1603.6, 1625.0], "text": " The Bulgarian Prosecutor's Office, the former Central Prosecutor's Office and the prosecutors in the countries have investigated the crimes in the country, of property during the so-called big excursion and so on."}, {"timestamp": [1625.0, 1629.0], "text": " But the most important question is about these serious crimes related to"}, {"timestamp": [1629.0, 1633.0], "text": " murders during these battles,"}, {"timestamp": [1633.0, 1638.0], "text": " the smuggling of this opposition."}, {"timestamp": [1638.0, 1651.0], "text": " And the prosecutor's office has has said that it cannot, according to their statistical data, conduct a search on the topic of a rejuvenation process."}, {"timestamp": [1651.0, 1658.0], "text": " So at the moment the state prosecution has no statistics for this type of crime."}, {"timestamp": [1658.0, 1665.6], "text": " Which is simple, these people should take off their hats and leave. This is absurd."}, {"timestamp": [1665.6, 1670.66], "text": " A state institution should not have statistics on what crimes..."}, {"timestamp": [1671.92, 1675.34], "text": " We should demand for some other kind of crime."}, {"timestamp": [1675.34, 1681.68], "text": " At the same time, it turns out that they destroyed statistical documents,"}, {"timestamp": [1681.68, 1687.0], "text": " but it is not clear how, why, why they were destroyed, if they were not preserved."}, {"timestamp": [1687.0, 1690.0], "text": " So this is absurd."}, {"timestamp": [1690.0, 1699.0], "text": " The society continues to lead this way, probably they will also be jealous of the Prosecutor's Office"}, {"timestamp": [1699.0, 1707.0], "text": " for the establishment of this fact. But without a doubt, the biggest problem is in the inaction of the state charge."}, {"timestamp": [1707.0, 1714.0], "text": " And here I am calling on my colleagues who are operative journalists, there is also the High Court."}, {"timestamp": [1714.0, 1719.0], "text": " What is happening with this case, Mr. Sarafov? What is happening with this case?"}, {"timestamp": [1719.0, 1726.68], "text": " Can the lawyers two years ago, before the victims, give signals and the prosecutor's office to leave them without movement,"}, {"timestamp": [1726.68, 1730.9], "text": " and now there is a political interference and the prosecutor's office to act immediately?"}, {"timestamp": [1730.9, 1732.9], "text": " Is it dependent on the..."}, {"timestamp": [1732.9, 1734.9], "text": " The Peevski's office."}, {"timestamp": [1734.9, 1739.22], "text": " Yes, directly. Or not. If it is dependent, should there be resignations?"}, {"timestamp": [1739.22, 1745.76], "text": " Who? The head of the Sofia Military District Prosecutor's Office. You will request. Let the colleagues ask."}, {"timestamp": [1745.76, 1750.56], "text": " Let them be interested and be journalists in place."}, {"timestamp": [1750.56, 1755.04], "text": " The Supreme Court. Signal. What happens with..."}, {"timestamp": [1755.04, 1757.92], "text": " What tax? Let them ask for a tax on this case."}, {"timestamp": [1760.48, 1766.0], "text": " Congratulations for lawyer Kashimov for running this and other similar cases."}, {"timestamp": [1766.0, 1772.0], "text": " The only way to counteract is to have access to information and if the society reacts."}, {"timestamp": [1772.0, 1793.0], "text": " There was an interesting comment, maybe now is the time to include it in the conversation. First we have Metin, a regular viewer of Kontra Komentar. He remembers this time and writes, I understand the irony in his words, I wouldn't be surprised,"}, {"timestamp": [1793.0, 1810.56], "text": " he writes that it was funny with two names, Martin and Metin. Our viewer Metin wasn't named after Martin. And his brother, Suleiman, was in the valley. This is what happened to the people at that time."}, {"timestamp": [1810.56, 1817.68], "text": " This is the most visible part. Except for all the other things that I really want to talk about in this episode."}, {"timestamp": [1817.68, 1829.0], "text": " All this is not accepted silently by the people. There is a demonstration in the villages of Benkovski, Koja Loba, Gorski Izvor, Mogilane, Preseka, Dobromirci."}, {"timestamp": [1829.0, 1833.0], "text": " As a result of these protests there were murders among the population there."}, {"timestamp": [1833.0, 1836.0], "text": " The protests were held in many other places in the eastern Rodopi."}, {"timestamp": [1836.0, 1839.0], "text": " A special crisis headquarters was formed for the destruction."}, {"timestamp": [1839.0, 1852.0], "text": " You mentioned this headquarters. Pencho-obadinsky is excluded from it. Parts of the Bulgarian People's Army were brought into action at that time and the forces of the then People's Republic, the Ministry of Foreign Affairs."}, {"timestamp": [1852.0, 1857.0], "text": " After 1995, the opposition got organized criminal forms."}, {"timestamp": [1857.0, 1866.6], "text": " On March 9, on the Bunovo train station, Turkish terrorists blow up a bomb in a car for mothers and children from the fast train Sofia-Burgas, which killed 4 women and 3 minors."}, {"timestamp": [1866.6, 1869.6], "text": " There are 9 victims, 2 of them minors."}, {"timestamp": [1869.6, 1877.0], "text": " My question to you is, if I don't go back to my assessment, maybe I should look at it from a subjective perspective,"}, {"timestamp": [1877.0, 1905.36], "text": " but how did it happen that from all the things that can be told about the process seem to be memories related reflects the memory of the real characteristics of the"}, {"timestamp": [1905.36, 1911.2], "text": " development process and there is nothing, if you look at the educational system to this day, I am not aware of"}, {"timestamp": [1911.2, 1928.32], "text": " any detailed article in which there was a textbook on the train in Plovdiv."}, {"timestamp": [1928.32, 1935.92], "text": " The commission published a thematic collection of these documents."}, {"timestamp": [1935.92, 1952.0], "text": " It was a question of a group of Bulgarian citizens from the Turkish origin who are radicalized. They find this way of opposition, which is extreme and which I think no normal person approves."}, {"timestamp": [1952.0, 2007.0], "text": " But in the bigger part, the opposition of this community, of the Turkish youth is peaceful, including the May events of 1989, and is not based on radical and extreme principles. What should be known is that in 2018, during the time of Minister Vlchev, during the time of the 3rd cabinet of the GERB, by historians like Prof. Evelina Kilbecheva and Lachezar Stoyanov,"}, {"timestamp": [2007.0, 2013.0], "text": " was that MONS for the first time adopted a new curriculum,"}, {"timestamp": [2013.0, 2020.0], "text": " in which for the first time the period of 1944-1989"}, {"timestamp": [2020.0, 2024.0], "text": " began to be studied in an independent section."}, {"timestamp": [2024.0, 2027.0], "text": " Until then, the history textbooks for the 10th grade were"}, {"timestamp": [2027.0, 2031.0], "text": " Bulgaria until the Second World War and one common lesson"}, {"timestamp": [2031.0, 2036.0], "text": " Bulgaria after the Second World War until today, which is not taught at all,"}, {"timestamp": [2036.0, 2042.0], "text": " which cannot be taught. The new curriculum from 2018"}, {"timestamp": [2042.0, 2050.0], "text": " adopted this course with new terms and facts to be explained and to be studied in an independent section."}, {"timestamp": [2050.0, 2053.0], "text": " But unfortunately the answer..."}, {"timestamp": [2053.0, 2067.44], "text": " It's about 30 years later. Some of them are former members of the BKP and later the BSP."}, {"timestamp": [2067.44, 2074.64], "text": " They didn't come and this new educational program is going to have new students next year."}, {"timestamp": [2074.64, 2085.6], "text": " These are five publications that have the approval of MOND to publish new books based on the new textbooks, the foundation of the new curriculum. It turned out that there are total"}, {"timestamp": [2085.6, 2094.8], "text": " falsifications, total omission of facts and then the foundation I represent"}, {"timestamp": [2094.8, 2101.2], "text": " Truth and Memory, we submitted a request to Minister Vlchev, the Ministry of Education"}, {"timestamp": [2101.2, 2110.48], "text": " stopped the textbooks and a review was conducted by a specially appointed commission by Minister Vlcev,"}, {"timestamp": [2110.48, 2113.52], "text": " in which a number of historians participated."}, {"timestamp": [2113.52, 2120.0], "text": " The textbooks, I can say, had a completely different view."}, {"timestamp": [2120.0, 2122.0], "text": " All these manipulations..."}, {"timestamp": [2122.0, 2123.0], "text": " More objective."}, {"timestamp": [2123.0, 2130.8], "text": " Of course. There were many facts. This was a big battle and this was a good thing we managed to do."}, {"timestamp": [2130.8, 2137.44], "text": " Including the topic of violence assimilation, which now appears in these five textbooks."}, {"timestamp": [2137.44, 2146.0], "text": " The practice shows that since the system is such that textbooks are are released and the teachers choose the published books."}, {"timestamp": [2146.0, 2153.0], "text": " About 70% of the teachers in Bulgaria choose the book by Prosveta."}, {"timestamp": [2153.0, 2157.0], "text": " It's not an advertisement, it's a fact. I'm saying it directly."}, {"timestamp": [2157.0, 2168.6], "text": " It was interesting that three or four days after the books were released, the same publishing house, Prosveta, gave a hard version of the whole textbook,"}, {"timestamp": [2168.6, 2173.5], "text": " which had the secret files, even though it wasn't in the textbook."}, {"timestamp": [2173.5, 2177.1], "text": " So according to you as a researcher, Prosveta's textbook is good?"}, {"timestamp": [2177.1, 2178.5], "text": " Yes, yes, yes."}, {"timestamp": [2178.5, 2190.72], "text": " This is a fact that most of the teachers choose him, there is a fact that in Belen there were 517 Turks in the court."}, {"timestamp": [2190.72, 2206.0], "text": " The camp is mentioned because in the first version there are books that say that the camp inen camp was created in 1949, in 1953 it was closed."}, {"timestamp": [2206.0, 2210.0], "text": " At that time there were 1,900 political..."}, {"timestamp": [2210.0, 2213.0], "text": " It worked until the 1980s."}, {"timestamp": [2213.0, 2216.0], "text": " Yes, with interruptions. But here is a textbook."}, {"timestamp": [2216.0, 2226.76], "text": " A young man who read that it was closed, this was really closed after Stalin's death, because that's the policy, the change of policy from the Soviet Union,"}, {"timestamp": [2226.76, 2233.28], "text": " where after Stalin's death, GULAG released one million campers from the system,"}, {"timestamp": [2233.28, 2239.72], "text": " that here in Belene, in 1956, they opened it only after three years again."}, {"timestamp": [2239.72, 2246.8], "text": " Todor Zhivkov, the original Todor Zhivkov, says that Todor Zhivkov had closed the camps in Bulgaria. You see, total manipulation."}, {"timestamp": [2246.8, 2250.0], "text": " And all of this, thank God, we managed to fight it out."}, {"timestamp": [2250.0, 2252.0], "text": " There was a big fight from the BSP."}, {"timestamp": [2252.0, 2257.0], "text": " There were no politicians to fight it out."}, {"timestamp": [2257.0, 2260.0], "text": " I would say that Minister Vltchev was left alone."}, {"timestamp": [2260.0, 2271.3], "text": " I will admit that, including from my parliamentary group, because there was a public hearing in the Education Commission,"}, {"timestamp": [2271.3, 2289.0], "text": " and here it is appropriate to be objective, that the person who did a lot for the Ministry of Education to accept this reform was then Vice-Premier Tsvetanov."}, {"timestamp": [2289.0, 2290.0], "text": " Tsvetan Tsvetanov."}, {"timestamp": [2290.0, 2301.0], "text": " Yes, Tsvetan Tsvetanov. He is interested and it is not the same what happens and why in Moln the administration"}, {"timestamp": [2301.0, 2305.0], "text": " starts to reject the proposals of the historians and so on."}, {"timestamp": [2305.0, 2310.0], "text": " Not like the prosecutor's office, which rejects the citizens' request for clarity."}, {"timestamp": [2310.0, 2331.0], "text": " No, it is professional, because MON every year publicly announces on its website that professional historians can make their demands and so on. But when initially these historians who mentioned brought their demands, they were rejected."}, {"timestamp": [2331.0, 2340.0], "text": " And that was quite challenging and in the end Minister Vlchev realized that this was his political task"}, {"timestamp": [2340.0, 2349.0], "text": " and he completed it until the end. They even wanted his resignation immediately after it was known that a new educational program was adopted."}, {"timestamp": [2349.0, 2354.0], "text": " There were big arguments in the National Assembly."}, {"timestamp": [2354.0, 2359.0], "text": " We know about the BSP that they don't give a word about the criminal character of the communist regime."}, {"timestamp": [2359.0, 2367.5], "text": " This political schizophrenia is very interesting because the BSP is the one that is rejected by the BKP,"}, {"timestamp": [2367.5, 2376.0], "text": " it is being replaced just to get rid of these crimes, and three years later, and even earlier,"}, {"timestamp": [2376.0, 2391.0], "text": " I wish that no stain falls on Todor Zhivkov and so on. Two more interesting comments from the audience. Polina Stoimenova, I trust Ms. Stoimenova that she writes objectively how things happened."}, {"timestamp": [2391.0, 2401.0], "text": " She writes, in 1984-1985 I was in a commanding office in Krdjeli, I slept in Mulchilgrad and I had an immediate view of what the people were doing with the BKP."}, {"timestamp": [2401.0, 2409.0], "text": " It was a crime, after 22 hours it was himself without warning. Can you comment on this?"}, {"timestamp": [2409.0, 2426.0], "text": " At the moment I am doing the interview and I am collecting these extremely heavy memories of the other live campers from Belene. What impressed me was that they said"}, {"timestamp": [2426.0, 2429.0], "text": " that the action of renaming was done at night."}, {"timestamp": [2429.0, 2432.0], "text": " So that it can't be seen at night"}, {"timestamp": [2432.0, 2435.0], "text": " in the houses."}, {"timestamp": [2435.0, 2438.0], "text": " There is a criticism towards me and maybe here you will"}, {"timestamp": [2438.0, 2441.0], "text": " at some extent buy the blame instead of me."}, {"timestamp": [2441.0, 2444.0], "text": " Because I was in Belene I made a short 15-minute"}, {"timestamp": [2444.0, 2446.0], "text": " reportage. Taboriski-Urchiski Since I was in Belene, I made a short 15-minute report."}, {"timestamp": [2446.0, 2452.0], "text": " Boris Kiorchiski writes that you didn't make a full episode about the camps and more specifically about Belene."}, {"timestamp": [2452.0, 2455.0], "text": " A very strong topic is this and a break from your side."}, {"timestamp": [2455.0, 2461.0], "text": " Yes, it is a break, but as far as I understand you are working with the living today."}, {"timestamp": [2461.0, 2467.6], "text": " Yes, but let's mention to this kind viewer that you were one of the few journalists who came."}, {"timestamp": [2467.6, 2486.0], "text": " There are colleagues, I can't deny it, and last year when we restored the annual tribute and this year for the first time you know we sent out the living campers to see them and to bow to them."}, {"timestamp": [2486.0, 2488.0], "text": " Not a little."}, {"timestamp": [2488.0, 2499.0], "text": " This year 500 people came. We as an organization had 350 tables for the sitting."}, {"timestamp": [2499.0, 2513.76], "text": " It turned out that we can not take the desired. So there is the place, here I catch a topic, let me mark it with one sentence, another totally inaction of the Bulgarian institutions,"}, {"timestamp": [2513.76, 2527.0], "text": " that since 2014 there has been a request, a request in the Ministry of Culture for Belen to be declared a national monument, a national monument of national significance."}, {"timestamp": [2527.0, 2534.0], "text": " And so far this procedure, three commissions are knocking on the same place, they can't solve this problem."}, {"timestamp": [2534.0, 2541.0], "text": " And we are waiting, including the friendship of the former campers, to choose a regular cabinet"}, {"timestamp": [2541.0, 2549.0], "text": " and we will already ask the question to the Minister-President, question, because the three ministers can't be changed."}, {"timestamp": [2549.0, 2557.0], "text": " Yes, we see goodwill, but we are reaching an administration that cannot make the right decisions"}, {"timestamp": [2557.0, 2567.8], "text": " and the state should be in the role of making a memorial, the first memorial in which the Bulgarian state"}, {"timestamp": [2567.8, 2572.0], "text": " is giving its own stamp, because there is no such memorial of victims of communism"}, {"timestamp": [2572.0, 2576.0], "text": " in which the state should participate. Everything we have claims about,"}, {"timestamp": [2576.0, 2587.0], "text": " this is from the donation of people, of political immigrants, the state is not participating. What do you think about this story?"}, {"timestamp": [2587.0, 2608.0], "text": " We are everywhere, from monuments, from totalitarian communist countries. I was impressed by a few things I visited Berlin recently, which I saw there."}, {"timestamp": [2608.0, 2618.0], "text": " The topography of terror, remains of the wall, the place where the Gestapo was located, a very influential monument of the Holocaust,"}, {"timestamp": [2618.0, 2621.0], "text": " of the beaten Jews, concrete rectangular blocks."}, {"timestamp": [2621.0, 2622.0], "text": " A labyrinth."}, {"timestamp": [2622.0, 2646.0], "text": " A labyrinth, yes. Very influential. and the related to the Red Terror in Bulgaria. And before that it was the home of the Bulgarian Communist Party."}, {"timestamp": [2646.0, 2650.0], "text": " Exactly. There are no arguments, the topic is not raised at all,"}, {"timestamp": [2650.0, 2652.0], "text": " that it should become such a memorial complex,"}, {"timestamp": [2652.0, 2655.0], "text": " just like in Berlin, in the office, the central of Stasi,"}, {"timestamp": [2655.0, 2658.0], "text": " one can see the office of the director of Stasi,"}, {"timestamp": [2658.0, 2662.0], "text": " the Stasi's instrumentarium, the museum, the actual museum."}, {"timestamp": [2662.0, 2667.0], "text": " For us this is something outside of any social discussion."}, {"timestamp": [2667.0, 2672.0], "text": " The mausoleum, the underground of the mausoleum can be turned into such a museum of communist terror."}, {"timestamp": [2672.0, 2676.0], "text": " Are there any movements in this direction as journalists?"}, {"timestamp": [2676.0, 2680.0], "text": " There is no state policy, but here we also have responsibility."}, {"timestamp": [2680.0, 2689.0], "text": " We already know the way, I say the more active people in the civil sector, because when there is no such state policy, it has to be created."}, {"timestamp": [2689.0, 2705.28], "text": " And we are the people who have to insist on such a policy to be created. And sooner or later we will do it. We already know the way. Unfortunately, these changes are difficult to make in Bulgaria."}, {"timestamp": [2705.28, 2711.12], "text": " We lived in a big confusion when the CDC won the elections in 1997,"}, {"timestamp": [2711.12, 2714.8], "text": " the end of communism was gone, state security was gone, etc."}, {"timestamp": [2714.8, 2729.44], "text": " From the open files of the Commission on Files we see how both the capital and privatization, everything goes into the hands of the red nomenclature."}, {"timestamp": [2729.44, 2737.76], "text": " If we go back to the process itself and the reaction of society then, no matter how weakly suppressed it was,"}, {"timestamp": [2737.76, 2746.0], "text": " the second wave of counter-action has been in the period of 1988-1989. We are already approaching 10th of November."}, {"timestamp": [2746.0, 2749.0], "text": " The so-called sacred date."}, {"timestamp": [2749.0, 2757.0], "text": " This second wave plays a significant role in forming an open opposition of the communist regime in the last few years."}, {"timestamp": [2757.0, 2767.0], "text": " Then different dissident groups are formed in the context of the perestroika that was going on then, the Independent Society for the Protection of Human Rights,"}, {"timestamp": [2767.0, 2773.0], "text": " the Independent Prof. Union of Support, the Committee 273, the Club for the Support of Voice and Voice-Composition,"}, {"timestamp": [2773.0, 2779.0], "text": " the ECO-Voice. All of them, according to the memorandum, are facing the re-establishment process."}, {"timestamp": [2779.0, 2788.0], "text": " In the second half of 1988, the non-aggressors of the re-establishment process, the Turks with the development process of Turkey and the POMACs, they joined the Independent Society for the Protection of Human Rights."}, {"timestamp": [2788.0, 2791.0], "text": " They are also the representatives of the Turkish law enforcement organizations."}, {"timestamp": [2791.0, 2794.0], "text": " You are talking about one such organization today."}, {"timestamp": [2794.0, 2797.0], "text": " We are already reaching the birthplace of the then DPS,"}, {"timestamp": [2797.0, 2801.0], "text": " which we know and associate with Ahmed Dogan,"}, {"timestamp": [2801.0, 2803.0], "text": " until recently."}, {"timestamp": [2803.0, 2808.3], "text": " What is the other information about Ahmed Dugan, with which you are probably familiar,"}, {"timestamp": [2808.3, 2814.9], "text": " working and following the archives of State Security? And why do we still argue about his past?"}, {"timestamp": [2814.9, 2829.0], "text": " Let's mention an organization that is very important. This is the Human Rights Protection League with its co- by Sabri Iskender, a former Belene's camp."}, {"timestamp": [2829.0, 2830.0], "text": " Yes, I missed him."}, {"timestamp": [2830.0, 2835.0], "text": " He is an exceptional figure in the opposition of Bulgarian citizens from the Turkish region."}, {"timestamp": [2835.0, 2840.0], "text": " He is a member of the former camp's association, which I mentioned."}, {"timestamp": [2840.0, 2846.0], "text": " They even send a signal for violations of the rights of the people of Odrozhivkov."}, {"timestamp": [2846.0, 2873.0], "text": " After Belen, most of the campers are forced to barracks to Bobov Dol and they can be taken as a temporary camp."}, {"timestamp": [2873.0, 2886.5], "text": " This is also a very interesting part. And as far as Ahmed Dogan is concerned, I have published on my website his file, which is over 1800 pages long."}, {"timestamp": [2886.5, 2890.0], "text": " It is saved and it became his file in State Security."}, {"timestamp": [2890.0, 2892.0], "text": " Is this part of it?"}, {"timestamp": [2892.0, 2894.0], "text": " I think so."}, {"timestamp": [2894.0, 2896.0], "text": " Or from the safe?"}, {"timestamp": [2896.0, 2898.0], "text": " The file is huge."}, {"timestamp": [2898.0, 2906.0], "text": " It shows that he as a figure is formed from state security."}, {"timestamp": [2906.0, 2915.0], "text": " There is a document from 1986 in which state security says that with our help he got on the bus,"}, {"timestamp": [2915.0, 2931.0], "text": " with our help he was transferred to the University of Sofia, with our help he is paid for the apartment, language training, paying for his specialization, making a banquet with the specialization,"}, {"timestamp": [2931.0, 2934.0], "text": " Even the banquet was created."}, {"timestamp": [2934.0, 2939.0], "text": " Yes, yes, yes. They read everything because they have a record. There are many documents."}, {"timestamp": [2939.0, 2949.5], "text": " And now the main question that he never answered, he has one statement about his file and his agency."}, {"timestamp": [2949.5, 2957.3], "text": " In 1997, when the then Commission Bonnev announced 23 members of the State Security,"}, {"timestamp": [2957.3, 2966.0], "text": " most of whom were from the DPSF, including Ahmed Dogan. If I'm not mistaken, I think I've remembered him."}, {"timestamp": [2966.0, 2976.0], "text": " He said then, I was from the Bulgarian opposition and we made a big blow from the prison in May 1989,"}, {"timestamp": [2976.0, 3008.0], "text": " the most serious blow to the regime he had brought. Now, I have worked with figures like Mr. Ozan Kash, who is the head of the biggest illegal organization what is happening in Bulgaria,"}, {"timestamp": [3008.0, 3015.0], "text": " which is not a member of the State Security, which is also in prison,"}, {"timestamp": [3015.0, 3020.0], "text": " but which has an illegal border, which continues to work from the prison,"}, {"timestamp": [3020.0, 3028.0], "text": " which, unlike Dogan, was released in the summer of 1990, when the DPS was already established."}, {"timestamp": [3028.0, 3035.0], "text": " The main question that Ahmet Dogan has to answer in public for so many years is"}, {"timestamp": [3035.0, 3071.0], "text": " because it is written in the documents that when he is renamed and he understands about the reproductive process. His leaders say that agent Sergei, he is under, but that he is not informed. Because he studied philosophy and he is known as an illegal."}, {"timestamp": [3071.0, 3079.0], "text": " But the original intention to send him to Turkey does not meet his support."}, {"timestamp": [3079.0, 3083.0], "text": " Illegal means a person with a false identity."}, {"timestamp": [3083.0, 3086.44], "text": " Deeply conspired. Deeply conspired."}, {"timestamp": [3086.44, 3151.0], "text": " But the problem with his request in Turkey is that he doesn't feel confident that he knows the Turkish language at a level that the West and will go and will not be considered as a philosopher in the Western philosophical fields. We still see that his closest friend is Dr. Ahmed Dogan and in his New Year's messages he always used high-level words, including philosophical terms, and the terms of the philosophy to show how much is more than them and how much is a guru in which they have to continue to bow for so many years."}, {"timestamp": [3151.0, 3188.5], "text": " But we see now that for about three months, for me personally, I allow myself this comment, it is extremely inadequate in the public space. And what he has names and until when he took it."}, {"timestamp": [3188.5, 3190.5], "text": " Can I tell you the date?"}, {"timestamp": [3190.5, 3191.5], "text": " Yes."}, {"timestamp": [3191.5, 3198.5], "text": " So, during the entire time of the revivification process he receives money, that is, he is a paid agent."}, {"timestamp": [3198.5, 3199.5], "text": " He is paid by the State Security Agency."}, {"timestamp": [3199.5, 3204.5], "text": " He is paid by the State Security Agency until June 1986."}, {"timestamp": [3204.5, 3209.0], "text": " This is the last payment. These are the documents from his case."}, {"timestamp": [3209.0, 3216.0], "text": " When the process of his legendary being illegal has already started."}, {"timestamp": [3216.0, 3227.0], "text": " No, they discover that he has joined a Varnens illegal organization, but he is not the leader of the May protests,"}, {"timestamp": [3227.0, 3230.0], "text": " in which he wants to be executed, and he is from the prison."}, {"timestamp": [3230.0, 3237.0], "text": " He is in the Pazardzhik prison in May 1989, so he cannot lead from there."}, {"timestamp": [3237.0, 3274.0], "text": " This is a categorical fact. He cannot talk about it. Besides that, since I have reflected all these activities and all these active events in which DPS was very seriously rejected by a path that was in the beginning of the DPS, will remind that one of the first public statements of Ahmed Dogan in 1990 was that he would want a ban on the BKP."}, {"timestamp": [3274.0, 3286.0], "text": " This is a fact. However, at the moment when the government of Filip Dimitrov, who worked with the support of the DPR,"}, {"timestamp": [3286.0, 3294.0], "text": " then the state security, the parallel government, which was built after the fall of..."}, {"timestamp": [3294.0, 3297.2], "text": " It wasn't the fall of Todor Zhivkov, it was a forced"}, {"timestamp": [3297.2, 3301.0], "text": " confrontation with the Kremlin's demand for power."}, {"timestamp": [3301.0, 3302.0], "text": " An internal party coup."}, {"timestamp": [3302.0, 3304.0], "text": " No, no, Kremlin's demands."}, {"timestamp": [3304.0, 3306.0], "text": " But it wasn't even a coup. The internal party's overthrow. No, no, Kreml's demands. And not even the overthrow?"}, {"timestamp": [3306.0, 3308.0], "text": " Yes, not even the overthrow."}, {"timestamp": [3308.0, 3312.0], "text": " I open the scope again, in the textbooks before they were changed it was written that Todor Zhivkov was fired."}, {"timestamp": [3312.0, 3314.0], "text": " I said, are you crazy? Who will fire him?"}, {"timestamp": [3314.0, 3316.0], "text": " Nobody can shout."}, {"timestamp": [3316.0, 3318.0], "text": " How will they fire him?"}, {"timestamp": [3318.0, 3320.0], "text": " One month earlier Petr Stoyanov..."}, {"timestamp": [3320.0, 3329.36], "text": " What is the reason? I have heard, I know to some extent the hypothetical answer to this question, but what is the reason for Gorbachev to be dissatisfied with Zhivkov?"}, {"timestamp": [3329.36, 3347.0], "text": " Because he is doing independent politics. He is over 80 years old. He has been so healthy in the government that nobody tells them is the then president of the Bulgarian National Bank, Vasil Kolarov."}, {"timestamp": [3347.0, 3353.0], "text": " But he has nothing to do with the communist movement."}, {"timestamp": [3353.0, 3371.98], "text": " For the upcoming third political year. I have worked with the huge archive case, because it also does not end with a punishment."}, {"timestamp": [3371.98, 3376.62], "text": " Case number 4 for the economic catastrophe caused by the Communist Party."}, {"timestamp": [3376.62, 3388.0], "text": " There are documents from the BNB presidents, but note that it is still 1987 and in some documents it is written in a bigger font than Todor Zhivkov, with bigger diopters."}, {"timestamp": [3388.0, 3395.0], "text": " It is written by Todor Zhivkov. Our debts have already crossed the critical line."}, {"timestamp": [3395.0, 3410.0], "text": " The only thing we can do is to make a reform with the increase in prices, because at the same time citizens from Yugoslavia come and buy here,"}, {"timestamp": [3410.0, 3430.0], "text": " like now the Bulgarians go to Odrin to buy cheap things, then they came to buy products that were already, especially in the province of Riatkost. The head of the BNB wrote that"}, {"timestamp": [3430.0, 3434.0], "text": " to date, in order to cover the external debt,"}, {"timestamp": [3434.0, 3438.0], "text": " which is not to be said that Todor Zhivkov took from Western banks"}, {"timestamp": [3438.0, 3443.0], "text": " borrowed money to build socialism and communism,"}, {"timestamp": [3443.0, 3449.0], "text": " this is a holy thing. They are building it, but they don't say that it is already in debt."}, {"timestamp": [3449.0, 3465.0], "text": " Vasil Kolarov writes that a country has been accepted to use up to 25% of its domestic gross product for the cancellation of their external debt. And we use it over 100%."}, {"timestamp": [3465.0, 3468.0], "text": " So, the balance is not 1989."}, {"timestamp": [3468.0, 3479.0], "text": " Zhivkov is taking short-term loans, because until then Bulgaria has been paying, and to owe Bulgaria even more, because they are..."}, {"timestamp": [3479.0, 3481.0], "text": " Over 100% of GDP."}, {"timestamp": [3481.0, 3484.0], "text": " This means you spend 100, you spend 200 and above."}, {"timestamp": [3484.0, 3488.0], "text": " Yes, and it only returns for the external debt. But the society doesn't know that."}, {"timestamp": [3488.0, 3493.0], "text": " Do you know when the Bulgarian people paid the external debt?"}, {"timestamp": [3493.0, 3494.0], "text": " The Communist external debt."}, {"timestamp": [3494.0, 3495.0], "text": " Yes."}, {"timestamp": [3495.0, 3496.0], "text": " When?"}, {"timestamp": [3496.0, 3497.0], "text": " In 2015."}, {"timestamp": [3497.0, 3510.0], "text": " But there are no guilty people. There are no guilty people in The cases that ended with a verdict are on the fingers of one hand."}, {"timestamp": [3510.0, 3526.0], "text": " These are Chernobyl and the case of destroying the files of the writer Georgi Markov, who was convicted last communist leader of the First General Directorate of State Security. He received a small but effective sentence."}, {"timestamp": [3526.0, 3537.0], "text": " These are the cases. The case of the camps was closed long ago. The accused were kept for more than three years in prison."}, {"timestamp": [3537.0, 3572.62], "text": " This was their only punishment. Todor Zhivkov was a well-known time in the Aris and so on. The court system's task was to lead to the feeling of impunity."}, {"timestamp": [3572.62, 3587.0], "text": " This is a reflection on the current years of wine and the maize gave the result today."}, {"timestamp": [3587.0, 3594.0], "text": " This is the development of this cynicism gathered in this sentence. We take the wine but with the maize."}, {"timestamp": [3594.0, 3595.0], "text": " Of Philip Bokov."}, {"timestamp": [3595.0, 3596.0], "text": " Philip Bokov, yes."}, {"timestamp": [3596.0, 3610.0], "text": " Let's give a little context to what is happening in front of our eyes now because of the will expressed by Danyan Peevski, is that many Bulgarians are not officially sympathetic to the Turks."}, {"timestamp": [3610.0, 3616.0], "text": " This is a fact. And they didn't approve the state policy towards them."}, {"timestamp": [3616.0, 3625.7], "text": " In the mixed regions, many Turks who leave their homeland quickly rely on their Bulgarian friends to help them with personal matters they failed to accomplish at that time."}, {"timestamp": [3625.7, 3630.0], "text": " This was a very extreme, expeditious action."}, {"timestamp": [3630.0, 3636.3], "text": " However, the fear of the totalitarian regime is very high and almost no approval has been publicly expressed."}, {"timestamp": [3636.3, 3638.3], "text": " At least in my opinion, this is the case."}, {"timestamp": [3638.3, 3650.0], "text": " However, there are many Bulgarians who approve of state policy. Some of them even think today that this is patriotism. Others others are just lost from the mass massacres."}, {"timestamp": [3650.0, 3656.0], "text": " We reach the leader of the other alternative DPS, the two DPSs, Dugan and Peevski."}, {"timestamp": [3656.0, 3667.0], "text": " He, based on everything that has been said so far, has the desire to be investigated, the guilty are being punished and so on."}, {"timestamp": [3667.0, 3673.0], "text": " And we come to the action of the Foreign Prosecutor's Office, which is starting to renew the case."}, {"timestamp": [3673.0, 3679.0], "text": " In short, there are enough witnesses since then. You mentioned that you work with 500 people."}, {"timestamp": [3679.0, 3689.0], "text": " You said that there were a lot of people on the ballot. I mentioned at the beginning that you are a court reporter in your professional career."}, {"timestamp": [3689.0, 3692.0], "text": " What do you think of what is happening today?"}, {"timestamp": [3692.0, 3696.0], "text": " The Military Prosecutor's Office resumed the case two years ago."}, {"timestamp": [3696.0, 3700.0], "text": " After Peevski said that there should be a punishment for the criminals"}, {"timestamp": [3700.0, 3705.0], "text": " and for the crimes of state security and the communist regime in the reviving process?"}, {"timestamp": [3705.0, 3710.0], "text": " It can be categorically talked about as a political interference in a court case,"}, {"timestamp": [3710.0, 3717.0], "text": " which the prosecutor's office should have ended with the eviction of two years ago."}, {"timestamp": [3717.0, 3722.0], "text": " So, two years ago the prosecutor's office denied the statement of the Sofia Court of Appeal"}, {"timestamp": [3722.0, 3731.0], "text": " that in order to stop the case, it should be stated whether there are data, whether it is established data for other people who committed crimes during this period,"}, {"timestamp": [3731.0, 3734.0], "text": " and not just five people from the communist top."}, {"timestamp": [3734.0, 3736.0], "text": " They died."}, {"timestamp": [3736.0, 3747.0], "text": " Yes, they died. And this is a very logical, very truthful and argumentative reasoning of the Bulgarian court, from which the prosecutor's office runs."}, {"timestamp": [3747.0, 3751.0], "text": " If Christ is not guilty, is Sen guilty?"}, {"timestamp": [3751.0, 3755.0], "text": " Yes, because he is the executor. There are executors and executors."}, {"timestamp": [3755.0, 3759.0], "text": " They are the officers of the state security and party secretaries."}, {"timestamp": [3759.0, 3769.0], "text": " According to the list you are part of the team. The secret list is from the year 13-13, 1986. It is online, it is in the State Council."}, {"timestamp": [3769.0, 3778.0], "text": " The prosecutor's office thinks that they are falling from the moon, as the task that the prosecutor who is now running away from me,"}, {"timestamp": [3778.0, 3786.84], "text": " he is a famous prosecutor, his name became popular for the 5 euro bill, ordered to find out where the agency's deeds are held."}, {"timestamp": [3786.84, 3790.0], "text": " There is a commission on the file from 17 years."}, {"timestamp": [3790.0, 3793.56], "text": " Do people know that there is such an institution?"}, {"timestamp": [3793.56, 3796.56], "text": " And so on."}, {"timestamp": [3796.56, 3803.56], "text": " So this is a political use for a while, but at the moment the prosecutor's office is also in a car accident."}, {"timestamp": [3803.56, 3809.0], "text": " Because after it started, at the moment it has to interrogate the victims."}, {"timestamp": [3809.0, 3814.0], "text": " And at the moment the victims, the former campers who survived, give testimony."}, {"timestamp": [3814.0, 3817.0], "text": " And I am sure that they give testimony."}, {"timestamp": [3817.0, 3820.0], "text": " Now they are starting to give testimony."}, {"timestamp": [3820.0, 3822.0], "text": " Meaning that they are already acting?"}, {"timestamp": [3822.0, 3823.0], "text": " Yes, yes."}, {"timestamp": [3823.0, 3830.0], "text": " They are already acting. Yes, yes, in the last days they are being reprimanded, they are stopping the reprimand, they are stopping what they have been doing for two years."}, {"timestamp": [3830.0, 3833.0], "text": " Because this is a long-term thing."}, {"timestamp": [3833.0, 3841.0], "text": " By the way, they are extremely correct in keeping the investigative secret, information from there has not come out."}, {"timestamp": [3841.0, 3842.0], "text": " From the prosecution?"}, {"timestamp": [3842.0, 3848.0], "text": " From the company that has access to the victims. They are not on the media, even now."}, {"timestamp": [3848.0, 3852.0], "text": " They are not on the media because they don't want to or because they don't invite them."}, {"timestamp": [3852.0, 3865.0], "text": " No, they don't want to get involved in such political games. Because this is a brutal use of a certain subject and it was a pre-election."}, {"timestamp": [3865.0, 3871.0], "text": " I am sure that this is not a wound that has grown for them. I am saying this considering the clich."}, {"timestamp": [3871.0, 3890.0], "text": " It will never grow. to make another bad person in Bulgarian politics, Dogan, to punish the prosecutor's office."}, {"timestamp": [3890.0, 3894.0], "text": " And the prosecutor's office was closed three days later."}, {"timestamp": [3894.0, 3898.0], "text": " I will give you another example with Germany."}, {"timestamp": [3898.0, 3907.0], "text": " A few years ago, a 98-year- was executed in front of the court. I think he was in Germany."}, {"timestamp": [3907.0, 3908.0], "text": " He was a woman."}, {"timestamp": [3908.0, 3911.0], "text": " I don't have a clear memory, but yes, he was."}, {"timestamp": [3911.0, 3912.0], "text": " She worked in a camp."}, {"timestamp": [3912.0, 3915.0], "text": " They were persecuted and sentenced to a long prison sentence."}, {"timestamp": [3915.0, 3925.76], "text": " Do we have hope that the people who wanted to be beaten, and the punishment for the criminals, will one day happen."}, {"timestamp": [3925.76, 3931.12], "text": " I think that while they breathe and are alive, they will live with this hope."}, {"timestamp": [3931.12, 3933.12], "text": " But do you have hope that this will be realized?"}, {"timestamp": [3933.12, 3951.0], "text": " I am a little pessimistic here, because unfortunately in the Bulgarian prosecutor's office there are no independent investigators who accept that they have to do their job, that it is a matter of a great tragedy"}, {"timestamp": [3951.0, 3960.0], "text": " and instead of being co-partners in the cover-up of this crime for so many years with no action, to do their job, to see."}, {"timestamp": [3960.0, 3966.0], "text": " By the way, not all magistrates are like that. I have worked with magistrates on the case of the camps."}, {"timestamp": [3966.0, 3971.0], "text": " A large part of them died of cancer, taking this case in their hearts."}, {"timestamp": [3971.0, 3973.0], "text": " General Nikolay Chiripov, the chairman."}, {"timestamp": [3973.0, 3975.0], "text": " Because of the information that..."}, {"timestamp": [3975.0, 3976.0], "text": " Yes."}, {"timestamp": [3976.0, 3982.0], "text": " Prosecutor Venceslav Teofilov. I took an interview, he gave an interview just before me."}, {"timestamp": [3982.0, 3988.0], "text": " I asked him if he knew the truth about the camps. He specifically investigated the murder in the Lovishki camps."}, {"timestamp": [3988.0, 3992.0], "text": " He told me that he knew a very small part of the story, but he knew it."}, {"timestamp": [3992.0, 3996.0], "text": " All these magistrates in the 90s worked very well."}, {"timestamp": [3996.0, 4001.0], "text": " Now there is a generation of administrators who are going to come out publicly."}, {"timestamp": [4001.0, 4008.24], "text": " They owe answers. They are independent judges, but not independent enough to have no account."}, {"timestamp": [4008.24, 4016.0], "text": " There is a person who is in charge of the duty, a chief prosecutor, this is a number one case of the police in the prosecutor's office."}, {"timestamp": [4016.0, 4021.12], "text": " Let the colleagues call upon you to ask, Mr. Saratov, what you will allow."}, {"timestamp": [4021.12, 4022.16], "text": " The case of the camps."}, {"timestamp": [4022.16, 4026.6], "text": " No, the case of the revocable process. The case of the camps is already over."}, {"timestamp": [4026.6, 4032.16], "text": " Why do you emphasize the agents?"}, {"timestamp": [4032.16, 4038.2], "text": " You have orders from the court to investigate what the Sofia Military District Prosecutor's Office is doing two years ago."}, {"timestamp": [4038.2, 4051.96], "text": " Are you only God, as Ivan Tatarchev said? This is an institution that is not working under one such case, which has killed thousands of people."}, {"timestamp": [4051.96, 4067.0], "text": " These are the camps that people from the neighboring villages have heard the voices of the women who have woman, the elderly Gazdov, and her name I forgot, she was beating them with a stick to fall from the rock."}, {"timestamp": [4067.0, 4068.0], "text": " Ruzhgiva."}, {"timestamp": [4068.0, 4069.0], "text": " Ruzhgiva."}, {"timestamp": [4069.0, 4070.0], "text": " This is Krajlovec."}, {"timestamp": [4070.0, 4071.0], "text": " Krajlovec, yes."}, {"timestamp": [4071.0, 4072.0], "text": " The camp of death."}, {"timestamp": [4072.0, 4078.0], "text": " And people heard the walls of these stupid people, because they fall from high and some of them have not died, right?"}, {"timestamp": [4078.0, 4086.24], "text": " They heard them through the night, how they are standing and so on. These are the camps. Maybe at the end of the conversation, since we are talking about the revolutionary process,"}, {"timestamp": [4086.24, 4095.44], "text": " would you like to summarize the experience, what have these people gone through outside the publicly available information?"}, {"timestamp": [4095.44, 4108.5], "text": " Assault, shooting, riots, protests, killings of people with firearms because of the actions of the military units of the People's Republic and the police of the People's Republic."}, {"timestamp": [4108.5, 4114.0], "text": " But if we have to summarize a collective image, what have these people experienced?"}, {"timestamp": [4114.0, 4127.5], "text": " They still live in a post-traumatic state. I worked with the heirs. They have lost their trust them to gain their trust because they were often lied to."}, {"timestamp": [4128.5, 4141.0], "text": " I am proud that I have their trust and I see how I work with the heirs of the liars who were in Belene."}, {"timestamp": [4150.0, 4154.0], "text": " When they talk about these things, it is a revolutionary process. They don't like this word, I'm sorry I'm using it, because it is communist, it is a process of violent assimilation. It happened yesterday."}, {"timestamp": [4154.0, 4157.0], "text": " Yes, that's right, it is a process of violent assimilation."}, {"timestamp": [4157.0, 4167.0], "text": " That's what they say. For me it is very important for this truth to come out. It is already in the textbooks. Now, how this material is taught is a very separate issue."}, {"timestamp": [4168.0, 4179.0], "text": " I had access to the teachers after the change of the educational program. I think there are many, many good teachers in the educational system who are clear."}, {"timestamp": [4184.32, 4190.4], "text": " The main thing is the totalitarian character of this system. When this is clear, it is very easy for them to explain to the students what it is about."}, {"timestamp": [4190.4, 4197.0], "text": " Because we are not talking about socialism, we are not talking about communism, we are talking about a totalitarian system,"}, {"timestamp": [4197.0, 4205.2], "text": " which has continued to exist much more than Nazism, another totalitarian system, and fascism, another totalitarian system of the 20th century."}, {"timestamp": [4205.2, 4215.2], "text": " So they live in a trauma. Today I did an interview with a former camp leader and he told me that almost every evening I sleep with a fever."}, {"timestamp": [4215.2, 4219.2], "text": " I asked him what the fever was for and he said it was a nightmare."}, {"timestamp": [4219.2, 4230.0], "text": " Yes, maybe, I don't know if it is necessary, but I will tell you a secret. You said that an interview will be filmed today. We are waiting for the film that you will prepare."}, {"timestamp": [4230.0, 4251.0], "text": " I am far away, yes, and we want to catch these people, because in the last year 10 campers, with Bulgarian citizens who went to the last camp, Tsvetana Dzermanova died this year."}, {"timestamp": [4251.0, 4260.0], "text": " We mentioned them in our worship. When I asked Safiye Yurda Kul, the president of the civil organization"}, {"timestamp": [4260.0, 4266.0], "text": " Justice, Law and Cultural Cooperation of the Balkans, I said, well, Sofia, have you died?"}, {"timestamp": [4266.0, 4272.0], "text": " So we can remember them. She gave me a list of 10 people. I said, let's agree, we have to record"}, {"timestamp": [4272.0, 4278.0], "text": " these people before it's too late. Because we were late with the campers from the first period,"}, {"timestamp": [4278.0, 4294.0], "text": " from the second period of Belene. We have to admit that. I have filmed some of them, we have worked with Benete, the open-duty series. We have representatives from all periods, but there could be many more."}, {"timestamp": [4294.0, 4305.7], "text": " And when we have such a modern technology, which you have here, it is a shame not to write about the history, because with one record it remains for eternity."}, {"timestamp": [4305.7, 4313.76], "text": " This is how they work in Yad Vashem, this is how they work in all, as you said, in Germany, they are in their prime years."}, {"timestamp": [4313.76, 4319.94], "text": " There the victims are guides to certain places where there is..."}, {"timestamp": [4319.94, 4340.84], "text": " Former prison guards of the Gestapo are guides at the moment. And the victims of GDR are guides in the secret investigation of the arrest in East Berlin, where until 1995 it did not exist on the map, it was so secret."}, {"timestamp": [4340.84, 4347.0], "text": " Now when students go there, there is a whirlwind of people, what kind of publications are there, what kind of things, and that's how the state works."}, {"timestamp": [4347.0, 4354.0], "text": " Can we compare the scales? I have heard that Stasi has been deeply and massively penetrated into society."}, {"timestamp": [4354.0, 4366.0], "text": " I don't remember the statistics, but one in every X, one digit number of their state security, the Stasi."}, {"timestamp": [4366.0, 4373.0], "text": " Can you compare the scale of the Stasi to the state security as far as you can generalize?"}, {"timestamp": [4373.0, 4377.0], "text": " Yes, we can compare it to some extent."}, {"timestamp": [4377.0, 4386.0], "text": " The repressive system of the GDR was good in the external knowledge. Yes, the Germans."}, {"timestamp": [4386.0, 4390.0], "text": " There is a huge cooperation on the DSA and Stasi line."}, {"timestamp": [4390.0, 4398.0], "text": " The first international act that is signed by the state security is with Stasi,"}, {"timestamp": [4398.0, 4414.0], "text": " because after the construction of the Berlin Wall, many East Germans find a way to the west, to freedom, as tourists through the border of the Republic of Bulgaria."}, {"timestamp": [4414.0, 4434.0], "text": " You know this fact. Many East Germans are killed on the Bulgarian border, shot and tried to pass it. There are also very successful ones, of course. It is interesting, I will say again, that one of the committee members is dedicated to this cooperation."}, {"timestamp": [4434.0, 4439.0], "text": " There are unique documents on how teams come here in the spring."}, {"timestamp": [4439.0, 4446.5], "text": " Where do you think they are? They are sitting on a sunny beach to follow Eastern German tourists."}, {"timestamp": [4446.5, 4454.5], "text": " The state security report is that we should more often make meetings with the other people to exchange experience."}, {"timestamp": [4454.5, 4486.16], "text": " What were these meetings? It was, here there was a possibility, the state security to provide information to the staff for West German a new one. These are telegrams and reports."}, {"timestamp": [4486.16, 4492.4], "text": " If they accidentally steal a new passport, they must be given to them by West Germany."}, {"timestamp": [4492.4, 4496.5], "text": " The State Security, if they are here, must give them such a document."}, {"timestamp": [4496.5, 4506.0], "text": " They also have to be given the names of the employees in the printing house in West Germany, who work in West Germany, if they come here, they should do everything they can to recruit them,"}, {"timestamp": [4506.0, 4510.0], "text": " because this way the falsification of these passports will begin."}, {"timestamp": [4510.0, 4520.0], "text": " Not to mention what delegations have been to Berlin from the Communist recognition,"}, {"timestamp": [4520.0, 4526.0], "text": " from the First General, and so on. It is a very good cooperation from their point of view."}, {"timestamp": [4526.0, 4531.0], "text": " Of course, after that, the KGB, because state security is under the KGB's hat."}, {"timestamp": [4531.0, 4535.0], "text": " You can't do anything there without the KGB knowing and so on."}, {"timestamp": [4535.0, 4541.0], "text": " Yes, so maybe I can summarize what I have achieved, what I have managed to learn,"}, {"timestamp": [4541.0, 4549.6], "text": " that things were there in a certain sense, were even more horrifying than in Bulgaria. Mothers brought for their children."}, {"timestamp": [4549.6, 4554.0], "text": " Literally. There were so many such things."}, {"timestamp": [4554.0, 4562.56], "text": " There are sons who brought for their fathers. These are some of the most disgusting files I have read."}, {"timestamp": [4562.56, 4565.0], "text": " The son writes a donation for his father."}, {"timestamp": [4565.0, 4577.0], "text": " Yes, there is also a person who is convicted of the communist regime, he was in prison and then, after leaving, he offers himself to the communist regime to donate for a medal."}, {"timestamp": [4577.0, 4586.0], "text": " And he says, I will donate and the state security is extremely suspicious. Why this man?"}, {"timestamp": [4586.0, 4588.0], "text": " He was a volunteer."}, {"timestamp": [4588.0, 4591.0], "text": " A parallel agent, is it what I brought?"}, {"timestamp": [4591.0, 4595.0], "text": " He said they will trust me because I was lying down and so on."}, {"timestamp": [4595.0, 4602.0], "text": " He is very well-placed because at one point he stopped bringing it."}, {"timestamp": [4602.0, 4606.0], "text": " They always get used to him, he was from Plovdivsko."}, {"timestamp": [4606.0, 4610.0], "text": " They asked him why he stopped driving."}, {"timestamp": [4610.0, 4614.0], "text": " He said he had a problem, he was a candidate in a bus and he didn't get 200 000."}, {"timestamp": [4614.0, 4616.0], "text": " He was disappointed, how could he do that?"}, {"timestamp": [4616.0, 4620.0], "text": " They said they would give him the 200 000 and he got in the bus."}, {"timestamp": [4620.0, 4623.0], "text": " Then he stopped again and said he wanted to buy a house here, but there was none."}, {"timestamp": [4623.0, 4625.0], "text": " He said he would arrange it, so he was put in charge."}, {"timestamp": [4625.0, 4627.0], "text": " He was also a kind of a governor."}, {"timestamp": [4627.0, 4635.0], "text": " Yes, and he became the first chairman of the Society of Repressed by Communism after 1989."}, {"timestamp": [4635.0, 4636.0], "text": " This is a fact."}, {"timestamp": [4636.0, 4637.0], "text": " He was a public figure."}, {"timestamp": [4637.0, 4639.0], "text": " Yes, a public figure, a deputy from the CDC."}, {"timestamp": [4654.4, 4663.68], "text": " So in Bulgaria there is a son of a communist official, who is recruited by the state security as a student. And in his report he says that he is the head of the entire network of agents in the French high school."}, {"timestamp": [4663.68, 4666.0], "text": " And he is so good at it that..."}, {"timestamp": [4666.0, 4667.0], "text": " A student."}, {"timestamp": [4667.0, 4668.0], "text": " Yes, a student."}, {"timestamp": [4668.0, 4669.0], "text": " They said, we don't have a job there."}, {"timestamp": [4669.0, 4670.0], "text": " He did everything."}, {"timestamp": [4670.0, 4673.0], "text": " Every day, every hour we know what is happening in the French High School."}, {"timestamp": [4673.0, 4676.0], "text": " However, his father was..."}, {"timestamp": [4676.0, 4680.0], "text": " He was on the hook, if I can use this expression."}, {"timestamp": [4680.0, 4682.0], "text": " Yes, he was on the hook."}, {"timestamp": [4682.0, 4710.4], "text": " He was on the hook for the party ticket, the son says that if it is proven that my father is guilty, we will publicly refuse him. Incredible. Let's not say that in Ahmed Dogan's file we have allowed ourselves to anonymize pages in which the State Security"}, {"timestamp": [4710.4, 4719.52], "text": " makes him describe in the most detailed intimacy what he does with his intimate friend."}, {"timestamp": [4719.52, 4721.52], "text": " This is not a precedent."}, {"timestamp": [4721.52, 4730.0], "text": " And he describes it. Yes, and I anonymized these things, because I am not interested in the Ahmet Dogan's file, but I am interested in how he has been accused."}, {"timestamp": [4730.0, 4736.0], "text": " He even has a curse that says that if he breaks his own curse towards you, it is better to kill yourself."}, {"timestamp": [4736.0, 4740.0], "text": " He has been accused of that. Let him come out and say that."}, {"timestamp": [4740.0, 4752.44], "text": " Let him come out and say that. He is formed as a way of thinking. Before I ask you if it's about the illustration, another page from the production process made a very strong impression on me."}, {"timestamp": [4752.44, 4767.8], "text": " I'm sorry that the Bulgarian movie lovers forgive me if I miss something, but in Bulgaria they didn't pay attention attention to this. A Turkish production on Netflix. I commented on it in a counter-comment."}, {"timestamp": [4767.8, 4769.8], "text": " It's a film about Naim Suleymanoglu."}, {"timestamp": [4769.8, 4771.8], "text": " I think it's called like that."}, {"timestamp": [4771.8, 4776.8], "text": " The story that the Turkish Kineji tells"}, {"timestamp": [4776.8, 4781.8], "text": " probably goes beyond the story of the people who helped him to escape."}, {"timestamp": [4781.8, 4783.8], "text": " He made one attempt, but didn't make it."}, {"timestamp": [4783.8, 4790.0], "text": " The DS blocked him. He made the second attempt, but it was it. He made a second attempt and was successful. I think he was successful. He ran from his Olympic participation."}, {"timestamp": [4790.0, 4791.0], "text": " He ran through Australia."}, {"timestamp": [4791.0, 4830.0], "text": " Yes, he ran through Australia. The effort to become a world star in the sport of barbells was broken said a word in front of the tribune of the UN and this greatly pushed the international community Communist Party, precisely because of the international pressure on the BKP and the People's Republic"}, {"timestamp": [4830.0, 4849.0], "text": " regarding what they are doing to the Bulgarian Turks. As far as you are familiar with the archive part of this story, how would you comment on this? We know a little bit about him and our propaganda interpretation is that he is a traitor, that he is kidnapped from other services."}, {"timestamp": [4849.0, 4858.0], "text": " But in fact, this is his conscious effort, which in a sense, because of the intensive sport regime he is in, costs his life."}, {"timestamp": [4858.0, 4860.0], "text": " He dies young."}, {"timestamp": [4860.0, 4863.0], "text": " Yes, but he is a world star."}, {"timestamp": [4863.0, 4870.0], "text": " Of course. He was a world star for Steinmetz. He competed for Bulgaria and then for Turkey."}, {"timestamp": [4870.0, 4874.0], "text": " He was forced to do these things because they hurt the most kind person."}, {"timestamp": [4874.0, 4915.28], "text": " He didn't tolerate this, he said it many times. and to say that the call of Todor Zhiv, all those people who, by the way, from 1985 observed and reported how everything was calm and quiet, suddenly started to cry."}, {"timestamp": [4915.28, 4918.64], "text": " This was in May, with the so-called May events."}, {"timestamp": [4918.64, 4921.2], "text": " Probably since then, this picture."}, {"timestamp": [4921.2, 4928.28], "text": " No, this is a picture from the 90th year of the People's Assembly, when they protested in front of the National Assembly."}, {"timestamp": [4928.28, 4933.4], "text": " There is a huge problem with the return of the administration, which is not solved."}, {"timestamp": [4933.4, 4939.2], "text": " DPS has been bringing in people for years, now they are trying to find someone to bring them in."}, {"timestamp": [4939.2, 4966.0], "text": " Before there was a separation, they brought in DPS, but they did not accept it, to clear the possibility for those people who allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not I know that they have a big administrative problem. At the moment."}, {"timestamp": [4966.0, 4977.0], "text": " These people are left to the fate of fate and when elections come they will use them for the next time."}, {"timestamp": [4977.0, 4979.0], "text": " Unfortunately."}, {"timestamp": [4979.0, 4996.0], "text": " But let's mention that not only Peevski misuses this politically. The first person who said he was using the reviving process, started playing the thin string for part of the Bulgarian society, which still lives with this trauma, was the other deputy chairman."}, {"timestamp": [4996.0, 4998.0], "text": " Dzhivdet Shakarov."}, {"timestamp": [4998.0, 5006.0], "text": " Dzhivdet Shakarov. When you were accused of Peevski having to register him because he submitted an electronic statement."}, {"timestamp": [5006.0, 5009.0], "text": " He said that this is a second revolutionary process."}, {"timestamp": [5009.0, 5018.0], "text": " I want to ask you this. Do you think that today, because I have heard the opinion, but usually it is a story by ear, not a first-person testimony,"}, {"timestamp": [5018.0, 5028.0], "text": " do you think that the leaders of the DPS will come to Bulgaria and there will will come and there will be a renaissance process. Do you have any information about that?"}, {"timestamp": [5028.0, 5046.0], "text": " Of course it is speculation. Now we have to say that there is another leader, I am referring to the leader of the renaissance, who two or three years ago, that one day the election could be opened again. It was not sanctioned in any way."}, {"timestamp": [5046.0, 5053.0], "text": " For such an insult, there must be a prosecutor's office."}, {"timestamp": [5053.0, 5058.0], "text": " They must take measures, because these parties play like jumping courts."}, {"timestamp": [5058.0, 5062.0], "text": " Before the elections, they are being called by the electorate."}, {"timestamp": [5062.0, 5073.0], "text": " The electorate claimed them. Yes. There are places where the DPS has never been present and suddenly municipal councilors have won."}, {"timestamp": [5073.0, 5085.36], "text": " There is an invasion. What do we do? They are afraid and people always jump. This is the first signal. and the two political forces, in such cases, they just"}, {"timestamp": [5085.36, 5088.56], "text": " are just a part of the electorate, the firm electorate."}, {"timestamp": [5088.56, 5093.36], "text": " And in fact, no one works for this society to normalize and"}, {"timestamp": [5093.36, 5097.6], "text": " to be tolerant. You, as you said, in some years, when it was"}, {"timestamp": [5097.6, 5100.0], "text": " tolerant, now the Bulgarian society is not tolerant."}, {"timestamp": [5100.0, 5102.96], "text": " Part of the Bulgarian society is not tolerant."}, {"timestamp": [5102.96, 5108.0], "text": " We can't blame our souls for this."}, {"timestamp": [5108.0, 5113.0], "text": " To conclude with this, because I think you are the most suitable person to give an answer to this question,"}, {"timestamp": [5113.0, 5119.0], "text": " is it too late for the illustration now and what can this illustration be if it is not too late?"}, {"timestamp": [5119.0, 5150.0], "text": " Of course, without thinking, I will say that it is never too late. The opening of the dossier turned out to be not too late did the job perfectly and continues to do so."}, {"timestamp": [5150.0, 5161.0], "text": " But the illustration is a topic that had to be, and it is one of the decommunications processes"}, {"timestamp": [5161.0, 5165.6], "text": " that had to be implemented at the beginning of the transition."}, {"timestamp": [5165.6, 5171.4], "text": " And those political minorities that promised decommunization."}, {"timestamp": [5171.4, 5174.6], "text": " This didn't happen. I'm watching the CDC. This didn't happen."}, {"timestamp": [5174.6, 5178.6], "text": " Of course, there are individual figures who worked for this."}, {"timestamp": [5178.6, 5189.0], "text": " Ivan Kurtev is the man who introduced the first decommunization law for the VAC, for the Highest Attestation Commission and for higher education."}, {"timestamp": [5189.0, 5195.0], "text": " What a war this was! This man was in a state of confusion."}, {"timestamp": [5195.0, 5207.0], "text": " Let's point out that the only comprehensive legislation for lustration was introduced by the People's Union in 1997, when Odessa was adopted."}, {"timestamp": [5207.0, 5213.0], "text": " The only comprehensive draft law was adopted by Odessa."}, {"timestamp": [5213.0, 5229.0], "text": " There were also some decommunization texts in the separate laws, but all of this was rejected, including a text about non-election of all members of the State Security."}, {"timestamp": [5229.0, 5234.0], "text": " This was cancelled with requests for votes of the DPS, the MPs of the DPS and the BSP."}, {"timestamp": [5234.0, 5236.0], "text": " The Constitutional Court cancelled it."}, {"timestamp": [5236.0, 5240.0], "text": " So we are in such a dilemma."}, {"timestamp": [5240.0, 5244.0], "text": " At the same time there is a political illustration."}, {"timestamp": [5244.0, 5248.0], "text": " We talked about it, I once mentioned it to you, you were quite surprised."}, {"timestamp": [5248.0, 5260.0], "text": " It started in 2011, after the end of 2010 the commission on the files passed one of the two Rubicon in the opening of the files."}, {"timestamp": [5260.0, 5268.36], "text": " One was the announcement of the cooperation in the diplomacy, the other Rubicon was the announcement of the cooperation in the Holy Synod."}, {"timestamp": [5268.36, 5293.0], "text": " These were huge battles that the Commission carried out with huge obstacles, of which 400 were active members of NATO and European Union, i.e. our partners."}, {"timestamp": [5293.0, 5297.0], "text": " They were led by agents from the State Security Service."}, {"timestamp": [5297.0, 5306.0], "text": " This was a big shame. He appealed to the government of Boyko Borisov and he said that they would no longer appoint ambassadors."}, {"timestamp": [5306.0, 5311.0], "text": " They would sit down and write their memoirs, because it was extremely uncivilized."}, {"timestamp": [5311.0, 5325.32], "text": " Since then, in Bulgarian politics and the appointment of diplomatic leaders and the general consuls are not appointed by Saturnica."}, {"timestamp": [5325.32, 5328.36], "text": " This is the only effect, this is a political illustration."}, {"timestamp": [5328.36, 5334.36], "text": " Not a single government, including the government with a majority of the BSP, there were such governments."}, {"timestamp": [5334.36, 5338.36], "text": " I am quoting Oresharski."}, {"timestamp": [5338.36, 5346.0], "text": " And in the Ministry Council, not a single government allows itself not allow it, with two very small exceptions."}, {"timestamp": [5346.0, 5350.0], "text": " They are in a service cabinet."}, {"timestamp": [5350.0, 5358.0], "text": " Former prime minister Denkov appointed a deputy minister for two hours when the information came out."}, {"timestamp": [5358.0, 5391.0], "text": " Deputy minister in the Ministry of Finance. the This is a political illustration. Even today the commission on the files has come out with a mandatory check of the second cabinet of the service of Glavchev."}, {"timestamp": [5391.0, 5396.0], "text": " The news from there is that there are no employees. This is good politics."}, {"timestamp": [5396.0, 5408.0], "text": " This is a huge thing."}, {"timestamp": [5408.0, 5417.0], "text": " Now, with the candidate deputies, all agents went to the left-hand side, not to the BSP, but to the new formations that are now united."}, {"timestamp": [5417.0, 5418.0], "text": " The new ones, yes."}, {"timestamp": [5418.0, 5421.0], "text": " Yes. In the past elections, all of this was in the new formations."}, {"timestamp": [5421.0, 5430.0], "text": " The united left, They were not united left in the last elections, they were there without BSP. Now they are with BSP."}, {"timestamp": [5430.0, 5452.0], "text": " Now they will go there again. But they didn't find the strength have any clean sheets. They didn't find any. Let's remind, because you mentioned SEM, this text was published in 2018 and then the authors were Stanishev, Sergei Stanishev and Anton Kutev, according to the rumor."}, {"timestamp": [5452.0, 5469.44], "text": " These are the people who attack the text for the illustration of the Council for Electronic Media and the Constitutional Court confirms, refutes this text. I think we have answered the question. Tomorrow my interlocutor will be Taifur Hussein, a journalist."}, {"timestamp": [5469.44, 5486.48], "text": " We talked with you today in a documentary, archival way. We looked at the things and of course with your active which is truly admirable. 2013, not 2018, my mistake, 2013 is the text for SEM."}, {"timestamp": [5486.48, 5494.12], "text": " Tomorrow we will continue with Tayfur, the point of view of the victims, the Bulgarian Turks and what they went through."}, {"timestamp": [5494.12, 5500.36], "text": " Thank you very much for your participation, good luck in the work you are doing and it was an honor for me to have you here tonight."}, {"timestamp": [5500.36, 5500.86], "text": " Thank you."}, {"timestamp": [5500.86, 5510.0], "text": " Thank you too. This was today's episode of Contra Komentar. An important conversation that, no matter how late it may seem, is still extremely relevant."}, {"timestamp": [5510.0, 5516.0], "text": " At least because of the fact that one person, as I said, two of the most odious figures in Bulgarian politics,"}, {"timestamp": [5516.0, 5525.32], "text": " one of them raised the issue, the prosecutor's office in the country is accusing and immediately imposes a procedure and the procedure was immediately stopped, partially stopped only two years ago,"}, {"timestamp": [5525.32, 5530.28], "text": " without any way of making it seem like it will get us closer"}, {"timestamp": [5530.28, 5534.96], "text": " to the moment when the least that can be done for the victims,"}, {"timestamp": [5534.96, 5538.24], "text": " namely criminals, to be punished, to be realized."}, {"timestamp": [5538.24, 5543.4], "text": " Until then, this will remain a dark, shameful page in Bulgarian history,"}, {"timestamp": [5543.4, 5549.0], "text": " one of the most significant, most large-scale and most horrifying crimes of communism."}, {"timestamp": [5549.0, 5556.0], "text": " It includes everything else, the camps, the camps and so on. Follow the work of the journalist Hristo Hristov, who was my guest this evening."}, {"timestamp": [5556.0, 5566.0], "text": " His website is www.drjavnasigurnost.com. If you search for it, it is www.drjavnasigbg.com is the abbreviation of the website"}, {"timestamp": [5566.0, 5568.0], "text": " written in Latin"}, {"timestamp": [5568.0, 5570.0], "text": " and you can find at least 3 articles"}, {"timestamp": [5570.0, 5572.0], "text": " on the topic we discussed"}, {"timestamp": [5572.0, 5574.0], "text": " today, written by"}, {"timestamp": [5574.0, 5576.0], "text": " Christo. Search, read,"}, {"timestamp": [5576.0, 5578.0], "text": " spread it among"}, {"timestamp": [5578.0, 5580.0], "text": " your friends so that they know"}, {"timestamp": [5580.0, 5582.0], "text": " what it means."}, {"timestamp": [5582.0, 5584.0], "text": " Today we end. Thank you for being together."}, {"timestamp": [5584.0, 5593.0], "text": " Thank you for the support, because your support gives this project the opportunity to develop, to exist and to meet you with well-known conversations on important topics."}, {"timestamp": [5593.0, 5599.0], "text": " You know how, super chat, super thanks and every single way I always write in the text under the video."}, {"timestamp": [5599.0, 5605.0], "text": " I will not miss thanking my friends from the cultural center G8, the Center for Independent Artistic Cinema, European cinema."}, {"timestamp": [5606.0, 5608.0], "text": " This is their website, G8cinema.com."}, {"timestamp": [5608.0, 5615.0], "text": " Watch it, choose some of the films and book in their space, in their cinema salons on G8 street in Sofia."}, {"timestamp": [5616.0, 5617.0], "text": " That was all."}, {"timestamp": [5617.0, 5619.0], "text": " See you tomorrow with Tayfur Hussein."}, {"timestamp": [5619.0, 5623.0], "text": " We continue the topic of political abuse with the topic of the recovery process."}, {"timestamp": [5623.0, 5625.48], "text": " Good night and good luck!"}], "text": " The following is a work of fiction. Any resemblance to actual persons, living or dead, is coincidental and unintentional. Hello friends, good evening. Let's start today's episode of Counter-commentary. Today my guest and associate in the studio is the journalist Hristo Hristov, researcher of the archives of State Security. Also in his practice there is a period when he was a court reporter. Hello, good evening. Hello, colleague Genov. Good evening. Thank you for being invited for this conversation. I continue with the words and precisely as a person who combines two in one, court reporter of the time and today the most sophisticated researcher of the archives of state security, I am not bothered to discuss the topic related to the rejuvenation process in Bulgarian politics. In short, what I want to say as a first words, the so-called revolutionary process is an attempt of the Bulgarian Communist Party to impose violent assimilation of the Muslim population in the country. This includes Turks, Palmatians, Tatars, Roma and so on. The topic is already actively used in the election campaign, I have already said that, so my interlocutor is Christo Hristov. The name that is known in the society process of systemic repressions against the mentioned social groups and ethnic groups is grotesque. Absolutely inappropriate. Nothing in common and nothing offensive is in this process. It started somewhere in the 70s and continued until the end of the 80s of the 20th century. This is one of the most shameful political pages for our people and our history. Our people, we Bulgarians, are famous and we are sometimes ashamed to underline how tolerant we are. Besides, this page or this so-called revolutionary process is unsuccessful. It is initially doomed to failure and gives exactly the opposite results of the expected, probably from the communists at that time. Instead of being united and integrated into society, the Bulgarian Muslims capsulate. To a great extent, they remain the same even today. And here, on the political scene, Darian Peevski appears and everything that follows from his appearance and the way he uses the topic of the revolutionary process. And this is the reason for today's episode. Good evening again, Christo Christo in the Contrakomentar studio. Hello again. Let's start with a little retrospective. After 1944, the politics of the Bulgarian Communist Party towards the Bulgarian Muslims varied from brutal repressions, violence, assimilation, toleration in a certain sense, namely, certain privileges are provided, Turkish-language intelligence is created, administrative staff, in addition to that special quotas in schools and the party-state apparatus. Newsstands in Turkey are published or at least such experiments are made. A large part of the state budget for development and industrialization of the so-called mixed regions is allocated, high children's benefits and other social privileges of the multi-child Muslim families. However, my first question to you is the so-called development process. How executive process get to you? Is there any specific reason? First of all I want to congratulate you that you are one of the few independent journalists who don't jump and don't look with a light hand at topics and they don't look at topics that most media think are in the past. You see, 35 years after the collapse of the communist system, we are in the mud of the past, unspoken, with unsolved problems, with hanging decades of deeds, so I admire them. You did a very good job of a retrospective of the communist regime. These attempts to assimilate began with the passportization in the 1950s, then there were attempts in the first half of the 1960s in connection with repressions against the General Secretary of the Communist Party, Todor Zhivkov, for the change of the name of the Bulgarian Parliament. After the changes, the declaration was adopted, which clearly shows that this is an assimilation. This is especially in this third phase, which I read with the permission of the Supreme Court, he said that he felt the fear of increasing this ethnic mass. He is so much suggested by the feeling of power, as it happens with most dictators, that he thought that if he didn't do this action, no one else would do it after him. His main goal is not only to change the names, but also to force Turkey to open the borders and to have a mandatory displacement of a life in the hearing, whether there will be or not, in a permanent anxiety, so that it reaches the autumn of 1984, when the name-calling campaign began in the Kyrgyzstan district. Todor Zhivkov thought that this way he period when the People's Republic of Bulgaria and the totalitarian communist regime took a brave step towards the third fall. The fall was in 1987. This is the forced expulsion of about 360,000 Bulgarian citizens from Turkey in the summer of 1989. This leads to an even more convincing economic catastrophe of this regime, because these people work in the agriculture sector, they are left without a job, they have a huge lack of work and so on. So you have correctly determined that this is a failed experiment. Let us remind that one of the first decisions of the Politburo after the forced resignation of Todor Zhivkov, is to reject this action, because he put a barrier in the this, there is one unanswered question. The process of revolution itself is in practice the withdrawal of the state, the forced withdrawal of the main personal rights such as the right to self-determination, the freedom of expression and so on. The concept of the revolutionary process itself, as you have outlined, is imposed by the party's top in the Bulgarian Communist Party. It is rooted in the official doctrine that all Bulgarian Turks were violently Islamized during the Ottoman Empire and, I quote, in their veins flows Bulgarian blood. These are two very dubious statements from a historical point of view, but the main question, whose answer we will try to find and give in this episode of Contra Commentar, is how these crimes remain without consequences and the guilty is not found even today. Let's remind that the case of the so-called reviving trial is actually the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the case of the corpses, but they missed the case that is the longest standing on the corpse. Number two. Exactly this case. And the colleagues, I understand that there is a change of generation in Bulgarian journalism, the young colleagues have no idea about these attempts to punish the communist crimes. But yes, this case was formed by the Military Prosecutor's Office in 1991. It was accused of Todor Zhivkov, former General Secretary of the Communist Party the Chairman of the State Council until 1989. The Minister of Foreign Affairs Peter Mladenov, the Minister of Internal Affairs General Dimitar Stoyanov, former Communist Prime Minister Georgiy Atanasov and a member of the Politburo, Pencho Kobadinsky, who is in a staff on the strategy for implementation, but he is excluded, by the way, from this staff, from this group, because he allows himself to say that we can't heal 800 thousand souls and say that they are gone. In his testimony, in part 1, I can literally quote it, because it's part of my biography of Todor Zhivkov isolated him and one day he called me, the first secretary of the Communist Party in Shumen, and he told me that Drogario Kobadinsky was the one who the Constitution and they ordered us to do it. Pencho Kubadin told me this and I immediately called the other Odrojevko. I asked him what had happened and he told me that he had finished his work. The most perfidious escape from responsibility was that the new constitution was made by the communists. And by the lawyers, even Todor Zhivkov took advantage of the new constitution to protect himself from corruption and abuse of power, using the new constitution, because they said that he was a state leader, according to the new constitution he is a state leader and he still doesn't have responsibility for criminal crimes. That is, if the president makes a disaster, makes another criminal act, he doesn't have responsibility. Which is quite controversial. But this is how it was adopted by the new constitution in 1991. And Todor Zhivkov was elected, who is the chairman of the State Council. The State Council has nothing to do with the presidency. It is a group body. Except that we position is built by us. Yes, and he came during the management of the BSP to the party cabinet of Jean Vidi, but the Supreme Court accepted that Todor Zhivkov was with his state head, therefore he cannot be sentenced because he was sentenced to seven years The case of the reviving process started, of course, as all other cases, very actively, but with the change that the Military Prosecutor's Office had set was to seek responsibility from the highest communist authority for those brightest and toughest Bulgarian citizens of the Turkish origin, who did not accept to be changed their names and were isolated, opening the concentration camp Belen again on the island of Persin. The first group arrived on December 28, 1984 from Krdjalisko. in 1984 by the first people of Kyrgyzstan. The prosecutor's office for 33 years can't find any 517 Bulgarian citizens from the Turkish continent who were isolated. That's the framework. You mean they can't find witnesses? Exactly. They come every year, part of them are on bail. They want to be in court. By the way, the prosecutor's office, knowing that they are in court, in practice, they are judging the state's payment. Maybe a dozen former campers or descendants of the deceased campers have already been judged by the prosecutor's office here in Bulgaria for violations of the rights of the court. For fraudulent trial. Yes, I had the opportunity to talk to some of them and they say that they want justice. The prosecutor's office, I will say it directly, instead of... The military? Yes, this is the case at the moment, it is being handled by the Sofia Military District Prosecutor's Office. You cannot be a state accused and for so many years you have been holding a case against the troops and So, unfortunately, we have to say directly, without exaggeration, that the prosecutor's office, instead of protecting the rights of the victims, became a participant in the investigation of these crimes. I will say it directly, this is a fact, let them prove it to me. They didn't have the opportunity to make so many court orders, to get in with the former campers' organization, which is very active in obtaining justice. These people don't want anything else. But it has come to the point that we can already see how the political use of this case is taking forward again the fact that the prosecutor of the civil organization Justice, Law and Cultural Cooperation of the Balkans. This is the name of the Court of Appeal, saying that there is no justice and the Prosecutor's Office has stopped the case. It was stopped in March 2022, because then the last accused of the Communist Party the Communist Party died, former Premier Georgi Atanasov. They complained about the resolution, the society complained about the resolution, so there are no politicians here. There is no DPS, there the rights of the victims of the revocable process, the responsibility and the steps of the prosecutor's office had to be established long ago in order to finish this case. Not through political pressure, but through questions to the court authorities about on this case? Are there other reasons why the chief prosecutors were replaced? In practice, it all started at the beginning of the transition, all chief prosecutors after the change were in their hands. Exactly. With different political varieties. Something more. When the former Lagerists' Society in Belene two years ago complained about this Procuratorate's decision to stop, something happened that very few people expected. The Sofia Appellate Court rejected the Procuratorate's decision Very few people expected the Sofia Court of Appeal to reject the prosecution's ruling. Two years ago, and more in the summer, the, by the executors, because the top one is... She has dropped this task, but there are executors, the entire repressive apparatus of state security and the prosecutor's office was surprised. The court, which is an admiration for the Bulgarian court, for this composition of the Sofia Court of Appeal, says that the prosecutor's office is obliged to present the Sofia, from the Society, that is getting to know each other. Actually, after the signal of Delian Peevski, the Prosecutor's Office is acting in a different way and is stopping the publication of the investigative materials, so that he can start to execute what Peevski has written in his signal. This is very interesting. He claims that Peevski and a group of deputies from his wing, Jordan Tson and a few other deputies, they are sending the signal. The question is why are are giving it now, as Dilyan Peevski, last year, at the beginning of the year of the revival process in Kyrgyzstan, said that there will be justice for the victims. So this December, the month, prepares this request. It's hard to write a signal. Yes, it's hard to write this signal. And by chance, we have now elections. The Prosecutor's Office in this decision literally accepts his thesis that without pointing out specific names, the Pevski signal points out that there are state security agents who are directly involved in the execution of the revocation process. But before there are agents involved, someone is leading them. And if the prosecutor's office is objective, it would have to start investigating the executors of this process two years ago, to start investigating the perpetrators of this process. And here is a very interesting document, a secret decree 1313 of the State Council of 1986, signed by Todor Zhivkov, which which there are over 100 names of senior state security officers from various central and district administrations of the DSE, who are awarded for the reviving process. And the most elementary and easy thing that the prosecutor's office can do and had to do is to start checking... Most likely some of them are still alive. Yes, yes. But look at what the prosecutor's office is doing now. It starts now in the decree ordered by military investigators to the Sofia Military District Prosecutor's Office to start picking up agents who have worked in the reviving process. There are officers there, and they are looking for agents. Why? I think that Pevski is aiming to attack Dugan. I wrote on my website that I will't be surprised if the prosecutor's office, taking this direction so expeditiously, before the elections, we see Ahmed Dogan and other state security agents, such as Ramadan Atalay, who have been announced a long time ago, we know this fact, to be called for a pre-election prosecutor's show on this matter. We will talk specifically about the role of 1984, the beginning of 1985. From the spring of 1982 in the spring of 1984. Initially, the campaign for the name of the country was supported by South Bulgaria, and the decision to name it as the Northern Bulgaria was taken in a meeting held on 18 January 1985. The then Minister-President Georgi Gatanasov for the first time uses the name of the revolutionary process. On February 11, the same year, Minister Dimitar Stoyanov counts the end of the active campaign, in which, perhaps next year, in 1985, 822,588 people were named. According to a later report, the number of the people named in 1984-1985 is 1,306,000. In March, Georgi Atanasov proudly announced that all citizens of the country already have names in accordance with their Bulgarian family root. I also gave three names and you mentioned them earlier. Todor Zhivkov, Georgi Atanasov, Dimitar Stoyanov. They are de facto innocent to this day. How is that possible? They are dead, I think three of them are dead, but they are innocent. Georgi Atanasov died in the last year of 2022. What is your comment on their innocence? This is the result of the lack of action of the Prosecutor's Office on this case. This is absurd. We have to remember that this case was brought to court twice. In 1993 it was returned to court with a statement. It was aimed at thepelling the victims, because when a court trial is being conducted and you say that the rights of the innocent are violated in Belene, you have to prove it. This is not a part of the communist regime. It is difficult to deal with so many victims, but the Prosecutor's Office has the resources and should be able to handle this task in 30 years. We don't see this thing being done. The authorities, with the help of the Foundation, have been providing access to information for about a year, a report with the Chief Prosecutor, in which they want, according to the law, access to public information, statistical information from 1989, from the collapse of communism until now. The Bulgarian Prosecutor's Office, the former Central Prosecutor's Office and the prosecutors in the countries have investigated the crimes in the country, of property during the so-called big excursion and so on. But the most important question is about these serious crimes related to murders during these battles, the smuggling of this opposition. And the prosecutor's office has has said that it cannot, according to their statistical data, conduct a search on the topic of a rejuvenation process. So at the moment the state prosecution has no statistics for this type of crime. Which is simple, these people should take off their hats and leave. This is absurd. A state institution should not have statistics on what crimes... We should demand for some other kind of crime. At the same time, it turns out that they destroyed statistical documents, but it is not clear how, why, why they were destroyed, if they were not preserved. So this is absurd. The society continues to lead this way, probably they will also be jealous of the Prosecutor's Office for the establishment of this fact. But without a doubt, the biggest problem is in the inaction of the state charge. And here I am calling on my colleagues who are operative journalists, there is also the High Court. What is happening with this case, Mr. Sarafov? What is happening with this case? Can the lawyers two years ago, before the victims, give signals and the prosecutor's office to leave them without movement, and now there is a political interference and the prosecutor's office to act immediately? Is it dependent on the... The Peevski's office. Yes, directly. Or not. If it is dependent, should there be resignations? Who? The head of the Sofia Military District Prosecutor's Office. You will request. Let the colleagues ask. Let them be interested and be journalists in place. The Supreme Court. Signal. What happens with... What tax? Let them ask for a tax on this case. Congratulations for lawyer Kashimov for running this and other similar cases. The only way to counteract is to have access to information and if the society reacts. There was an interesting comment, maybe now is the time to include it in the conversation. First we have Metin, a regular viewer of Kontra Komentar. He remembers this time and writes, I understand the irony in his words, I wouldn't be surprised, he writes that it was funny with two names, Martin and Metin. Our viewer Metin wasn't named after Martin. And his brother, Suleiman, was in the valley. This is what happened to the people at that time. This is the most visible part. Except for all the other things that I really want to talk about in this episode. All this is not accepted silently by the people. There is a demonstration in the villages of Benkovski, Koja Loba, Gorski Izvor, Mogilane, Preseka, Dobromirci. As a result of these protests there were murders among the population there. The protests were held in many other places in the eastern Rodopi. A special crisis headquarters was formed for the destruction. You mentioned this headquarters. Pencho-obadinsky is excluded from it. Parts of the Bulgarian People's Army were brought into action at that time and the forces of the then People's Republic, the Ministry of Foreign Affairs. After 1995, the opposition got organized criminal forms. On March 9, on the Bunovo train station, Turkish terrorists blow up a bomb in a car for mothers and children from the fast train Sofia-Burgas, which killed 4 women and 3 minors. There are 9 victims, 2 of them minors. My question to you is, if I don't go back to my assessment, maybe I should look at it from a subjective perspective, but how did it happen that from all the things that can be told about the process seem to be memories related reflects the memory of the real characteristics of the development process and there is nothing, if you look at the educational system to this day, I am not aware of any detailed article in which there was a textbook on the train in Plovdiv. The commission published a thematic collection of these documents. It was a question of a group of Bulgarian citizens from the Turkish origin who are radicalized. They find this way of opposition, which is extreme and which I think no normal person approves. But in the bigger part, the opposition of this community, of the Turkish youth is peaceful, including the May events of 1989, and is not based on radical and extreme principles. What should be known is that in 2018, during the time of Minister Vlchev, during the time of the 3rd cabinet of the GERB, by historians like Prof. Evelina Kilbecheva and Lachezar Stoyanov, was that MONS for the first time adopted a new curriculum, in which for the first time the period of 1944-1989 began to be studied in an independent section. Until then, the history textbooks for the 10th grade were Bulgaria until the Second World War and one common lesson Bulgaria after the Second World War until today, which is not taught at all, which cannot be taught. The new curriculum from 2018 adopted this course with new terms and facts to be explained and to be studied in an independent section. But unfortunately the answer... It's about 30 years later. Some of them are former members of the BKP and later the BSP. They didn't come and this new educational program is going to have new students next year. These are five publications that have the approval of MOND to publish new books based on the new textbooks, the foundation of the new curriculum. It turned out that there are total falsifications, total omission of facts and then the foundation I represent Truth and Memory, we submitted a request to Minister Vlchev, the Ministry of Education stopped the textbooks and a review was conducted by a specially appointed commission by Minister Vlcev, in which a number of historians participated. The textbooks, I can say, had a completely different view. All these manipulations... More objective. Of course. There were many facts. This was a big battle and this was a good thing we managed to do. Including the topic of violence assimilation, which now appears in these five textbooks. The practice shows that since the system is such that textbooks are are released and the teachers choose the published books. About 70% of the teachers in Bulgaria choose the book by Prosveta. It's not an advertisement, it's a fact. I'm saying it directly. It was interesting that three or four days after the books were released, the same publishing house, Prosveta, gave a hard version of the whole textbook, which had the secret files, even though it wasn't in the textbook. So according to you as a researcher, Prosveta's textbook is good? Yes, yes, yes. This is a fact that most of the teachers choose him, there is a fact that in Belen there were 517 Turks in the court. The camp is mentioned because in the first version there are books that say that the camp inen camp was created in 1949, in 1953 it was closed. At that time there were 1,900 political... It worked until the 1980s. Yes, with interruptions. But here is a textbook. A young man who read that it was closed, this was really closed after Stalin's death, because that's the policy, the change of policy from the Soviet Union, where after Stalin's death, GULAG released one million campers from the system, that here in Belene, in 1956, they opened it only after three years again. Todor Zhivkov, the original Todor Zhivkov, says that Todor Zhivkov had closed the camps in Bulgaria. You see, total manipulation. And all of this, thank God, we managed to fight it out. There was a big fight from the BSP. There were no politicians to fight it out. I would say that Minister Vltchev was left alone. I will admit that, including from my parliamentary group, because there was a public hearing in the Education Commission, and here it is appropriate to be objective, that the person who did a lot for the Ministry of Education to accept this reform was then Vice-Premier Tsvetanov. Tsvetan Tsvetanov. Yes, Tsvetan Tsvetanov. He is interested and it is not the same what happens and why in Moln the administration starts to reject the proposals of the historians and so on. Not like the prosecutor's office, which rejects the citizens' request for clarity. No, it is professional, because MON every year publicly announces on its website that professional historians can make their demands and so on. But when initially these historians who mentioned brought their demands, they were rejected. And that was quite challenging and in the end Minister Vlchev realized that this was his political task and he completed it until the end. They even wanted his resignation immediately after it was known that a new educational program was adopted. There were big arguments in the National Assembly. We know about the BSP that they don't give a word about the criminal character of the communist regime. This political schizophrenia is very interesting because the BSP is the one that is rejected by the BKP, it is being replaced just to get rid of these crimes, and three years later, and even earlier, I wish that no stain falls on Todor Zhivkov and so on. Two more interesting comments from the audience. Polina Stoimenova, I trust Ms. Stoimenova that she writes objectively how things happened. She writes, in 1984-1985 I was in a commanding office in Krdjeli, I slept in Mulchilgrad and I had an immediate view of what the people were doing with the BKP. It was a crime, after 22 hours it was himself without warning. Can you comment on this? At the moment I am doing the interview and I am collecting these extremely heavy memories of the other live campers from Belene. What impressed me was that they said that the action of renaming was done at night. So that it can't be seen at night in the houses. There is a criticism towards me and maybe here you will at some extent buy the blame instead of me. Because I was in Belene I made a short 15-minute reportage. Taboriski-Urchiski Since I was in Belene, I made a short 15-minute report. Boris Kiorchiski writes that you didn't make a full episode about the camps and more specifically about Belene. A very strong topic is this and a break from your side. Yes, it is a break, but as far as I understand you are working with the living today. Yes, but let's mention to this kind viewer that you were one of the few journalists who came. There are colleagues, I can't deny it, and last year when we restored the annual tribute and this year for the first time you know we sent out the living campers to see them and to bow to them. Not a little. This year 500 people came. We as an organization had 350 tables for the sitting. It turned out that we can not take the desired. So there is the place, here I catch a topic, let me mark it with one sentence, another totally inaction of the Bulgarian institutions, that since 2014 there has been a request, a request in the Ministry of Culture for Belen to be declared a national monument, a national monument of national significance. And so far this procedure, three commissions are knocking on the same place, they can't solve this problem. And we are waiting, including the friendship of the former campers, to choose a regular cabinet and we will already ask the question to the Minister-President, question, because the three ministers can't be changed. Yes, we see goodwill, but we are reaching an administration that cannot make the right decisions and the state should be in the role of making a memorial, the first memorial in which the Bulgarian state is giving its own stamp, because there is no such memorial of victims of communism in which the state should participate. Everything we have claims about, this is from the donation of people, of political immigrants, the state is not participating. What do you think about this story? We are everywhere, from monuments, from totalitarian communist countries. I was impressed by a few things I visited Berlin recently, which I saw there. The topography of terror, remains of the wall, the place where the Gestapo was located, a very influential monument of the Holocaust, of the beaten Jews, concrete rectangular blocks. A labyrinth. A labyrinth, yes. Very influential. and the related to the Red Terror in Bulgaria. And before that it was the home of the Bulgarian Communist Party. Exactly. There are no arguments, the topic is not raised at all, that it should become such a memorial complex, just like in Berlin, in the office, the central of Stasi, one can see the office of the director of Stasi, the Stasi's instrumentarium, the museum, the actual museum. For us this is something outside of any social discussion. The mausoleum, the underground of the mausoleum can be turned into such a museum of communist terror. Are there any movements in this direction as journalists? There is no state policy, but here we also have responsibility. We already know the way, I say the more active people in the civil sector, because when there is no such state policy, it has to be created. And we are the people who have to insist on such a policy to be created. And sooner or later we will do it. We already know the way. Unfortunately, these changes are difficult to make in Bulgaria. We lived in a big confusion when the CDC won the elections in 1997, the end of communism was gone, state security was gone, etc. From the open files of the Commission on Files we see how both the capital and privatization, everything goes into the hands of the red nomenclature. If we go back to the process itself and the reaction of society then, no matter how weakly suppressed it was, the second wave of counter-action has been in the period of 1988-1989. We are already approaching 10th of November. The so-called sacred date. This second wave plays a significant role in forming an open opposition of the communist regime in the last few years. Then different dissident groups are formed in the context of the perestroika that was going on then, the Independent Society for the Protection of Human Rights, the Independent Prof. Union of Support, the Committee 273, the Club for the Support of Voice and Voice-Composition, the ECO-Voice. All of them, according to the memorandum, are facing the re-establishment process. In the second half of 1988, the non-aggressors of the re-establishment process, the Turks with the development process of Turkey and the POMACs, they joined the Independent Society for the Protection of Human Rights. They are also the representatives of the Turkish law enforcement organizations. You are talking about one such organization today. We are already reaching the birthplace of the then DPS, which we know and associate with Ahmed Dogan, until recently. What is the other information about Ahmed Dugan, with which you are probably familiar, working and following the archives of State Security? And why do we still argue about his past? Let's mention an organization that is very important. This is the Human Rights Protection League with its co- by Sabri Iskender, a former Belene's camp. Yes, I missed him. He is an exceptional figure in the opposition of Bulgarian citizens from the Turkish region. He is a member of the former camp's association, which I mentioned. They even send a signal for violations of the rights of the people of Odrozhivkov. After Belen, most of the campers are forced to barracks to Bobov Dol and they can be taken as a temporary camp. This is also a very interesting part. And as far as Ahmed Dogan is concerned, I have published on my website his file, which is over 1800 pages long. It is saved and it became his file in State Security. Is this part of it? I think so. Or from the safe? The file is huge. It shows that he as a figure is formed from state security. There is a document from 1986 in which state security says that with our help he got on the bus, with our help he was transferred to the University of Sofia, with our help he is paid for the apartment, language training, paying for his specialization, making a banquet with the specialization, Even the banquet was created. Yes, yes, yes. They read everything because they have a record. There are many documents. And now the main question that he never answered, he has one statement about his file and his agency. In 1997, when the then Commission Bonnev announced 23 members of the State Security, most of whom were from the DPSF, including Ahmed Dogan. If I'm not mistaken, I think I've remembered him. He said then, I was from the Bulgarian opposition and we made a big blow from the prison in May 1989, the most serious blow to the regime he had brought. Now, I have worked with figures like Mr. Ozan Kash, who is the head of the biggest illegal organization what is happening in Bulgaria, which is not a member of the State Security, which is also in prison, but which has an illegal border, which continues to work from the prison, which, unlike Dogan, was released in the summer of 1990, when the DPS was already established. The main question that Ahmet Dogan has to answer in public for so many years is because it is written in the documents that when he is renamed and he understands about the reproductive process. His leaders say that agent Sergei, he is under, but that he is not informed. Because he studied philosophy and he is known as an illegal. But the original intention to send him to Turkey does not meet his support. Illegal means a person with a false identity. Deeply conspired. Deeply conspired. But the problem with his request in Turkey is that he doesn't feel confident that he knows the Turkish language at a level that the West and will go and will not be considered as a philosopher in the Western philosophical fields. We still see that his closest friend is Dr. Ahmed Dogan and in his New Year's messages he always used high-level words, including philosophical terms, and the terms of the philosophy to show how much is more than them and how much is a guru in which they have to continue to bow for so many years. But we see now that for about three months, for me personally, I allow myself this comment, it is extremely inadequate in the public space. And what he has names and until when he took it. Can I tell you the date? Yes. So, during the entire time of the revivification process he receives money, that is, he is a paid agent. He is paid by the State Security Agency. He is paid by the State Security Agency until June 1986. This is the last payment. These are the documents from his case. When the process of his legendary being illegal has already started. No, they discover that he has joined a Varnens illegal organization, but he is not the leader of the May protests, in which he wants to be executed, and he is from the prison. He is in the Pazardzhik prison in May 1989, so he cannot lead from there. This is a categorical fact. He cannot talk about it. Besides that, since I have reflected all these activities and all these active events in which DPS was very seriously rejected by a path that was in the beginning of the DPS, will remind that one of the first public statements of Ahmed Dogan in 1990 was that he would want a ban on the BKP. This is a fact. However, at the moment when the government of Filip Dimitrov, who worked with the support of the DPR, then the state security, the parallel government, which was built after the fall of... It wasn't the fall of Todor Zhivkov, it was a forced confrontation with the Kremlin's demand for power. An internal party coup. No, no, Kremlin's demands. But it wasn't even a coup. The internal party's overthrow. No, no, Kreml's demands. And not even the overthrow? Yes, not even the overthrow. I open the scope again, in the textbooks before they were changed it was written that Todor Zhivkov was fired. I said, are you crazy? Who will fire him? Nobody can shout. How will they fire him? One month earlier Petr Stoyanov... What is the reason? I have heard, I know to some extent the hypothetical answer to this question, but what is the reason for Gorbachev to be dissatisfied with Zhivkov? Because he is doing independent politics. He is over 80 years old. He has been so healthy in the government that nobody tells them is the then president of the Bulgarian National Bank, Vasil Kolarov. But he has nothing to do with the communist movement. For the upcoming third political year. I have worked with the huge archive case, because it also does not end with a punishment. Case number 4 for the economic catastrophe caused by the Communist Party. There are documents from the BNB presidents, but note that it is still 1987 and in some documents it is written in a bigger font than Todor Zhivkov, with bigger diopters. It is written by Todor Zhivkov. Our debts have already crossed the critical line. The only thing we can do is to make a reform with the increase in prices, because at the same time citizens from Yugoslavia come and buy here, like now the Bulgarians go to Odrin to buy cheap things, then they came to buy products that were already, especially in the province of Riatkost. The head of the BNB wrote that to date, in order to cover the external debt, which is not to be said that Todor Zhivkov took from Western banks borrowed money to build socialism and communism, this is a holy thing. They are building it, but they don't say that it is already in debt. Vasil Kolarov writes that a country has been accepted to use up to 25% of its domestic gross product for the cancellation of their external debt. And we use it over 100%. So, the balance is not 1989. Zhivkov is taking short-term loans, because until then Bulgaria has been paying, and to owe Bulgaria even more, because they are... Over 100% of GDP. This means you spend 100, you spend 200 and above. Yes, and it only returns for the external debt. But the society doesn't know that. Do you know when the Bulgarian people paid the external debt? The Communist external debt. Yes. When? In 2015. But there are no guilty people. There are no guilty people in The cases that ended with a verdict are on the fingers of one hand. These are Chernobyl and the case of destroying the files of the writer Georgi Markov, who was convicted last communist leader of the First General Directorate of State Security. He received a small but effective sentence. These are the cases. The case of the camps was closed long ago. The accused were kept for more than three years in prison. This was their only punishment. Todor Zhivkov was a well-known time in the Aris and so on. The court system's task was to lead to the feeling of impunity. This is a reflection on the current years of wine and the maize gave the result today. This is the development of this cynicism gathered in this sentence. We take the wine but with the maize. Of Philip Bokov. Philip Bokov, yes. Let's give a little context to what is happening in front of our eyes now because of the will expressed by Danyan Peevski, is that many Bulgarians are not officially sympathetic to the Turks. This is a fact. And they didn't approve the state policy towards them. In the mixed regions, many Turks who leave their homeland quickly rely on their Bulgarian friends to help them with personal matters they failed to accomplish at that time. This was a very extreme, expeditious action. However, the fear of the totalitarian regime is very high and almost no approval has been publicly expressed. At least in my opinion, this is the case. However, there are many Bulgarians who approve of state policy. Some of them even think today that this is patriotism. Others others are just lost from the mass massacres. We reach the leader of the other alternative DPS, the two DPSs, Dugan and Peevski. He, based on everything that has been said so far, has the desire to be investigated, the guilty are being punished and so on. And we come to the action of the Foreign Prosecutor's Office, which is starting to renew the case. In short, there are enough witnesses since then. You mentioned that you work with 500 people. You said that there were a lot of people on the ballot. I mentioned at the beginning that you are a court reporter in your professional career. What do you think of what is happening today? The Military Prosecutor's Office resumed the case two years ago. After Peevski said that there should be a punishment for the criminals and for the crimes of state security and the communist regime in the reviving process? It can be categorically talked about as a political interference in a court case, which the prosecutor's office should have ended with the eviction of two years ago. So, two years ago the prosecutor's office denied the statement of the Sofia Court of Appeal that in order to stop the case, it should be stated whether there are data, whether it is established data for other people who committed crimes during this period, and not just five people from the communist top. They died. Yes, they died. And this is a very logical, very truthful and argumentative reasoning of the Bulgarian court, from which the prosecutor's office runs. If Christ is not guilty, is Sen guilty? Yes, because he is the executor. There are executors and executors. They are the officers of the state security and party secretaries. According to the list you are part of the team. The secret list is from the year 13-13, 1986. It is online, it is in the State Council. The prosecutor's office thinks that they are falling from the moon, as the task that the prosecutor who is now running away from me, he is a famous prosecutor, his name became popular for the 5 euro bill, ordered to find out where the agency's deeds are held. There is a commission on the file from 17 years. Do people know that there is such an institution? And so on. So this is a political use for a while, but at the moment the prosecutor's office is also in a car accident. Because after it started, at the moment it has to interrogate the victims. And at the moment the victims, the former campers who survived, give testimony. And I am sure that they give testimony. Now they are starting to give testimony. Meaning that they are already acting? Yes, yes. They are already acting. Yes, yes, in the last days they are being reprimanded, they are stopping the reprimand, they are stopping what they have been doing for two years. Because this is a long-term thing. By the way, they are extremely correct in keeping the investigative secret, information from there has not come out. From the prosecution? From the company that has access to the victims. They are not on the media, even now. They are not on the media because they don't want to or because they don't invite them. No, they don't want to get involved in such political games. Because this is a brutal use of a certain subject and it was a pre-election. I am sure that this is not a wound that has grown for them. I am saying this considering the clich. It will never grow. to make another bad person in Bulgarian politics, Dogan, to punish the prosecutor's office. And the prosecutor's office was closed three days later. I will give you another example with Germany. A few years ago, a 98-year- was executed in front of the court. I think he was in Germany. He was a woman. I don't have a clear memory, but yes, he was. She worked in a camp. They were persecuted and sentenced to a long prison sentence. Do we have hope that the people who wanted to be beaten, and the punishment for the criminals, will one day happen. I think that while they breathe and are alive, they will live with this hope. But do you have hope that this will be realized? I am a little pessimistic here, because unfortunately in the Bulgarian prosecutor's office there are no independent investigators who accept that they have to do their job, that it is a matter of a great tragedy and instead of being co-partners in the cover-up of this crime for so many years with no action, to do their job, to see. By the way, not all magistrates are like that. I have worked with magistrates on the case of the camps. A large part of them died of cancer, taking this case in their hearts. General Nikolay Chiripov, the chairman. Because of the information that... Yes. Prosecutor Venceslav Teofilov. I took an interview, he gave an interview just before me. I asked him if he knew the truth about the camps. He specifically investigated the murder in the Lovishki camps. He told me that he knew a very small part of the story, but he knew it. All these magistrates in the 90s worked very well. Now there is a generation of administrators who are going to come out publicly. They owe answers. They are independent judges, but not independent enough to have no account. There is a person who is in charge of the duty, a chief prosecutor, this is a number one case of the police in the prosecutor's office. Let the colleagues call upon you to ask, Mr. Saratov, what you will allow. The case of the camps. No, the case of the revocable process. The case of the camps is already over. Why do you emphasize the agents? You have orders from the court to investigate what the Sofia Military District Prosecutor's Office is doing two years ago. Are you only God, as Ivan Tatarchev said? This is an institution that is not working under one such case, which has killed thousands of people. These are the camps that people from the neighboring villages have heard the voices of the women who have woman, the elderly Gazdov, and her name I forgot, she was beating them with a stick to fall from the rock. Ruzhgiva. Ruzhgiva. This is Krajlovec. Krajlovec, yes. The camp of death. And people heard the walls of these stupid people, because they fall from high and some of them have not died, right? They heard them through the night, how they are standing and so on. These are the camps. Maybe at the end of the conversation, since we are talking about the revolutionary process, would you like to summarize the experience, what have these people gone through outside the publicly available information? Assault, shooting, riots, protests, killings of people with firearms because of the actions of the military units of the People's Republic and the police of the People's Republic. But if we have to summarize a collective image, what have these people experienced? They still live in a post-traumatic state. I worked with the heirs. They have lost their trust them to gain their trust because they were often lied to. I am proud that I have their trust and I see how I work with the heirs of the liars who were in Belene. When they talk about these things, it is a revolutionary process. They don't like this word, I'm sorry I'm using it, because it is communist, it is a process of violent assimilation. It happened yesterday. Yes, that's right, it is a process of violent assimilation. That's what they say. For me it is very important for this truth to come out. It is already in the textbooks. Now, how this material is taught is a very separate issue. I had access to the teachers after the change of the educational program. I think there are many, many good teachers in the educational system who are clear. The main thing is the totalitarian character of this system. When this is clear, it is very easy for them to explain to the students what it is about. Because we are not talking about socialism, we are not talking about communism, we are talking about a totalitarian system, which has continued to exist much more than Nazism, another totalitarian system, and fascism, another totalitarian system of the 20th century. So they live in a trauma. Today I did an interview with a former camp leader and he told me that almost every evening I sleep with a fever. I asked him what the fever was for and he said it was a nightmare. Yes, maybe, I don't know if it is necessary, but I will tell you a secret. You said that an interview will be filmed today. We are waiting for the film that you will prepare. I am far away, yes, and we want to catch these people, because in the last year 10 campers, with Bulgarian citizens who went to the last camp, Tsvetana Dzermanova died this year. We mentioned them in our worship. When I asked Safiye Yurda Kul, the president of the civil organization Justice, Law and Cultural Cooperation of the Balkans, I said, well, Sofia, have you died? So we can remember them. She gave me a list of 10 people. I said, let's agree, we have to record these people before it's too late. Because we were late with the campers from the first period, from the second period of Belene. We have to admit that. I have filmed some of them, we have worked with Benete, the open-duty series. We have representatives from all periods, but there could be many more. And when we have such a modern technology, which you have here, it is a shame not to write about the history, because with one record it remains for eternity. This is how they work in Yad Vashem, this is how they work in all, as you said, in Germany, they are in their prime years. There the victims are guides to certain places where there is... Former prison guards of the Gestapo are guides at the moment. And the victims of GDR are guides in the secret investigation of the arrest in East Berlin, where until 1995 it did not exist on the map, it was so secret. Now when students go there, there is a whirlwind of people, what kind of publications are there, what kind of things, and that's how the state works. Can we compare the scales? I have heard that Stasi has been deeply and massively penetrated into society. I don't remember the statistics, but one in every X, one digit number of their state security, the Stasi. Can you compare the scale of the Stasi to the state security as far as you can generalize? Yes, we can compare it to some extent. The repressive system of the GDR was good in the external knowledge. Yes, the Germans. There is a huge cooperation on the DSA and Stasi line. The first international act that is signed by the state security is with Stasi, because after the construction of the Berlin Wall, many East Germans find a way to the west, to freedom, as tourists through the border of the Republic of Bulgaria. You know this fact. Many East Germans are killed on the Bulgarian border, shot and tried to pass it. There are also very successful ones, of course. It is interesting, I will say again, that one of the committee members is dedicated to this cooperation. There are unique documents on how teams come here in the spring. Where do you think they are? They are sitting on a sunny beach to follow Eastern German tourists. The state security report is that we should more often make meetings with the other people to exchange experience. What were these meetings? It was, here there was a possibility, the state security to provide information to the staff for West German a new one. These are telegrams and reports. If they accidentally steal a new passport, they must be given to them by West Germany. The State Security, if they are here, must give them such a document. They also have to be given the names of the employees in the printing house in West Germany, who work in West Germany, if they come here, they should do everything they can to recruit them, because this way the falsification of these passports will begin. Not to mention what delegations have been to Berlin from the Communist recognition, from the First General, and so on. It is a very good cooperation from their point of view. Of course, after that, the KGB, because state security is under the KGB's hat. You can't do anything there without the KGB knowing and so on. Yes, so maybe I can summarize what I have achieved, what I have managed to learn, that things were there in a certain sense, were even more horrifying than in Bulgaria. Mothers brought for their children. Literally. There were so many such things. There are sons who brought for their fathers. These are some of the most disgusting files I have read. The son writes a donation for his father. Yes, there is also a person who is convicted of the communist regime, he was in prison and then, after leaving, he offers himself to the communist regime to donate for a medal. And he says, I will donate and the state security is extremely suspicious. Why this man? He was a volunteer. A parallel agent, is it what I brought? He said they will trust me because I was lying down and so on. He is very well-placed because at one point he stopped bringing it. They always get used to him, he was from Plovdivsko. They asked him why he stopped driving. He said he had a problem, he was a candidate in a bus and he didn't get 200 000. He was disappointed, how could he do that? They said they would give him the 200 000 and he got in the bus. Then he stopped again and said he wanted to buy a house here, but there was none. He said he would arrange it, so he was put in charge. He was also a kind of a governor. Yes, and he became the first chairman of the Society of Repressed by Communism after 1989. This is a fact. He was a public figure. Yes, a public figure, a deputy from the CDC. So in Bulgaria there is a son of a communist official, who is recruited by the state security as a student. And in his report he says that he is the head of the entire network of agents in the French high school. And he is so good at it that... A student. Yes, a student. They said, we don't have a job there. He did everything. Every day, every hour we know what is happening in the French High School. However, his father was... He was on the hook, if I can use this expression. Yes, he was on the hook. He was on the hook for the party ticket, the son says that if it is proven that my father is guilty, we will publicly refuse him. Incredible. Let's not say that in Ahmed Dogan's file we have allowed ourselves to anonymize pages in which the State Security makes him describe in the most detailed intimacy what he does with his intimate friend. This is not a precedent. And he describes it. Yes, and I anonymized these things, because I am not interested in the Ahmet Dogan's file, but I am interested in how he has been accused. He even has a curse that says that if he breaks his own curse towards you, it is better to kill yourself. He has been accused of that. Let him come out and say that. Let him come out and say that. He is formed as a way of thinking. Before I ask you if it's about the illustration, another page from the production process made a very strong impression on me. I'm sorry that the Bulgarian movie lovers forgive me if I miss something, but in Bulgaria they didn't pay attention attention to this. A Turkish production on Netflix. I commented on it in a counter-comment. It's a film about Naim Suleymanoglu. I think it's called like that. The story that the Turkish Kineji tells probably goes beyond the story of the people who helped him to escape. He made one attempt, but didn't make it. The DS blocked him. He made the second attempt, but it was it. He made a second attempt and was successful. I think he was successful. He ran from his Olympic participation. He ran through Australia. Yes, he ran through Australia. The effort to become a world star in the sport of barbells was broken said a word in front of the tribune of the UN and this greatly pushed the international community Communist Party, precisely because of the international pressure on the BKP and the People's Republic regarding what they are doing to the Bulgarian Turks. As far as you are familiar with the archive part of this story, how would you comment on this? We know a little bit about him and our propaganda interpretation is that he is a traitor, that he is kidnapped from other services. But in fact, this is his conscious effort, which in a sense, because of the intensive sport regime he is in, costs his life. He dies young. Yes, but he is a world star. Of course. He was a world star for Steinmetz. He competed for Bulgaria and then for Turkey. He was forced to do these things because they hurt the most kind person. He didn't tolerate this, he said it many times. and to say that the call of Todor Zhiv, all those people who, by the way, from 1985 observed and reported how everything was calm and quiet, suddenly started to cry. This was in May, with the so-called May events. Probably since then, this picture. No, this is a picture from the 90th year of the People's Assembly, when they protested in front of the National Assembly. There is a huge problem with the return of the administration, which is not solved. DPS has been bringing in people for years, now they are trying to find someone to bring them in. Before there was a separation, they brought in DPS, but they did not accept it, to clear the possibility for those people who allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not allowed to work, he was not I know that they have a big administrative problem. At the moment. These people are left to the fate of fate and when elections come they will use them for the next time. Unfortunately. But let's mention that not only Peevski misuses this politically. The first person who said he was using the reviving process, started playing the thin string for part of the Bulgarian society, which still lives with this trauma, was the other deputy chairman. Dzhivdet Shakarov. Dzhivdet Shakarov. When you were accused of Peevski having to register him because he submitted an electronic statement. He said that this is a second revolutionary process. I want to ask you this. Do you think that today, because I have heard the opinion, but usually it is a story by ear, not a first-person testimony, do you think that the leaders of the DPS will come to Bulgaria and there will will come and there will be a renaissance process. Do you have any information about that? Of course it is speculation. Now we have to say that there is another leader, I am referring to the leader of the renaissance, who two or three years ago, that one day the election could be opened again. It was not sanctioned in any way. For such an insult, there must be a prosecutor's office. They must take measures, because these parties play like jumping courts. Before the elections, they are being called by the electorate. The electorate claimed them. Yes. There are places where the DPS has never been present and suddenly municipal councilors have won. There is an invasion. What do we do? They are afraid and people always jump. This is the first signal. and the two political forces, in such cases, they just are just a part of the electorate, the firm electorate. And in fact, no one works for this society to normalize and to be tolerant. You, as you said, in some years, when it was tolerant, now the Bulgarian society is not tolerant. Part of the Bulgarian society is not tolerant. We can't blame our souls for this. To conclude with this, because I think you are the most suitable person to give an answer to this question, is it too late for the illustration now and what can this illustration be if it is not too late? Of course, without thinking, I will say that it is never too late. The opening of the dossier turned out to be not too late did the job perfectly and continues to do so. But the illustration is a topic that had to be, and it is one of the decommunications processes that had to be implemented at the beginning of the transition. And those political minorities that promised decommunization. This didn't happen. I'm watching the CDC. This didn't happen. Of course, there are individual figures who worked for this. Ivan Kurtev is the man who introduced the first decommunization law for the VAC, for the Highest Attestation Commission and for higher education. What a war this was! This man was in a state of confusion. Let's point out that the only comprehensive legislation for lustration was introduced by the People's Union in 1997, when Odessa was adopted. The only comprehensive draft law was adopted by Odessa. There were also some decommunization texts in the separate laws, but all of this was rejected, including a text about non-election of all members of the State Security. This was cancelled with requests for votes of the DPS, the MPs of the DPS and the BSP. The Constitutional Court cancelled it. So we are in such a dilemma. At the same time there is a political illustration. We talked about it, I once mentioned it to you, you were quite surprised. It started in 2011, after the end of 2010 the commission on the files passed one of the two Rubicon in the opening of the files. One was the announcement of the cooperation in the diplomacy, the other Rubicon was the announcement of the cooperation in the Holy Synod. These were huge battles that the Commission carried out with huge obstacles, of which 400 were active members of NATO and European Union, i.e. our partners. They were led by agents from the State Security Service. This was a big shame. He appealed to the government of Boyko Borisov and he said that they would no longer appoint ambassadors. They would sit down and write their memoirs, because it was extremely uncivilized. Since then, in Bulgarian politics and the appointment of diplomatic leaders and the general consuls are not appointed by Saturnica. This is the only effect, this is a political illustration. Not a single government, including the government with a majority of the BSP, there were such governments. I am quoting Oresharski. And in the Ministry Council, not a single government allows itself not allow it, with two very small exceptions. They are in a service cabinet. Former prime minister Denkov appointed a deputy minister for two hours when the information came out. Deputy minister in the Ministry of Finance. the This is a political illustration. Even today the commission on the files has come out with a mandatory check of the second cabinet of the service of Glavchev. The news from there is that there are no employees. This is good politics. This is a huge thing. Now, with the candidate deputies, all agents went to the left-hand side, not to the BSP, but to the new formations that are now united. The new ones, yes. Yes. In the past elections, all of this was in the new formations. The united left, They were not united left in the last elections, they were there without BSP. Now they are with BSP. Now they will go there again. But they didn't find the strength have any clean sheets. They didn't find any. Let's remind, because you mentioned SEM, this text was published in 2018 and then the authors were Stanishev, Sergei Stanishev and Anton Kutev, according to the rumor. These are the people who attack the text for the illustration of the Council for Electronic Media and the Constitutional Court confirms, refutes this text. I think we have answered the question. Tomorrow my interlocutor will be Taifur Hussein, a journalist. We talked with you today in a documentary, archival way. We looked at the things and of course with your active which is truly admirable. 2013, not 2018, my mistake, 2013 is the text for SEM. Tomorrow we will continue with Tayfur, the point of view of the victims, the Bulgarian Turks and what they went through. Thank you very much for your participation, good luck in the work you are doing and it was an honor for me to have you here tonight. Thank you. Thank you too. This was today's episode of Contra Komentar. An important conversation that, no matter how late it may seem, is still extremely relevant. At least because of the fact that one person, as I said, two of the most odious figures in Bulgarian politics, one of them raised the issue, the prosecutor's office in the country is accusing and immediately imposes a procedure and the procedure was immediately stopped, partially stopped only two years ago, without any way of making it seem like it will get us closer to the moment when the least that can be done for the victims, namely criminals, to be punished, to be realized. Until then, this will remain a dark, shameful page in Bulgarian history, one of the most significant, most large-scale and most horrifying crimes of communism. It includes everything else, the camps, the camps and so on. Follow the work of the journalist Hristo Hristov, who was my guest this evening. His website is www.drjavnasigurnost.com. If you search for it, it is www.drjavnasigbg.com is the abbreviation of the website written in Latin and you can find at least 3 articles on the topic we discussed today, written by Christo. Search, read, spread it among your friends so that they know what it means. Today we end. Thank you for being together. Thank you for the support, because your support gives this project the opportunity to develop, to exist and to meet you with well-known conversations on important topics. You know how, super chat, super thanks and every single way I always write in the text under the video. I will not miss thanking my friends from the cultural center G8, the Center for Independent Artistic Cinema, European cinema. This is their website, G8cinema.com. Watch it, choose some of the films and book in their space, in their cinema salons on G8 street in Sofia. That was all. See you tomorrow with Tayfur Hussein. We continue the topic of political abuse with the topic of the recovery process. Good night and good luck!"}